<?php
define('FPDF_FONTPATH','../font/');
require_once( "fpdf.php" );
$pdf = new FPDF( 'L', 'mm','A3');
$today=date("d.m.y");
//ГОСТ 3.1105-2011 КЭ Форма 8 (Заглавный лист)
$pdf->AddFont('gost_a','','GOSTmi.php');
$pdf->SetFont('gost_a','',12);
$pdf->SetAutoPageBreak(true,0);
$pdf->SetMargins(5,0,5);
$pdf->SetTextColor( 0, 0, 0);
$pdf->AddPage();
// Рамка B6Ф1 ГОСТ 3.1103-82 блок вида и назначения документа
$pdf->rect(20,283.5,395,8.5);
$pdf->rect(20,283.5,23.5,8.5);
	$pdf->SetFont('gost_a','',15);	
	$pdf->SetXY(20,283.5);
	$pdf->Cell(23.5,8.5,'КЭ',0,0,'C');
	$pdf->Cell(356,8.5,'Карта эскизов',0,0,'L');
	$pdf->Cell(15.6,8.5,$pdf->PageNo(),0,0,'C');
$pdf->rect(399.4,283.5,15.6,8.5);
//Данные
$pdf->SetFont('gost_a','',12);
$pdf->rect(20,34.75,395,248.75);
// Рамка Б5Ф1 ГОСТ 3.1103-2011 блок вспомогательной информации
$pdf->rect(20,5,395,8.5);
$pdf->line(277.2,5,277.2,8);
$pdf->line(337,5,337,13.5);
$pdf->line(383.8,5,383.8,13.5);
$pdf->line(399.4,5,399.4,13.5);
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$pdf->rect(7.25,216.6,12.75,75.4);
$pdf->line(7.25,232.2,11.5,232.2);
$pdf->line(15.75,232.2,20,232.2);
$pdf->line(7.25,248,11.5,248);
$pdf->line(15.75,248,20,248);
$pdf->line(7.25,268.8,20,268.8);
$pdf->line(11.5,216.6,11.5,292);
$pdf->line(15.75,216.6,15.75,292);
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(3,5,17,80.6);
$pdf->line(7.25,5,7.25,85.6);
$pdf->line(11.5,5,11.5,85.6);
$pdf->line(15.75,5,15.75,85.6);
$pdf->line(3,20.6,20,20.6);
$pdf->line(3,41.4,20,41.4);
$pdf->line(3,64.8,20,64.8);
$pdf->line(3,75.2,20,75.2);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(11.5,85.6,8.5,80.6);
$pdf->line(15.75,85.6,15.75,166.2);
$pdf->line(11.5,101.2,20,101.2);
$pdf->line(11.5,122,20,122);
$pdf->line(11.5,145.4,20,145.4);
$pdf->line(11.5,155.8,20,155.8);
// Рамка Б3Ф1 ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(48.4,13.5,80.6,21.25);
$pdf->line(48.4,17.75,129,17.75);
$pdf->line(48.4,22,129,22);
$pdf->line(48.4,26.25,129,26.25);
$pdf->line(48.4,30.5,129,30.5);
$pdf->line(58.8,13.5,58.8,34.75);
$pdf->line(69.2,13.5,69.2,34.75);
$pdf->line(92.6,13.5,92.6,34.75);
$pdf->line(113.4,13.5,113.4,34.75);
// Рамка Б1Ф3 ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$pdf->rect(225.2,13.5,189.8,12.75);
$pdf->line(266.8,13.5,266.8,26.25);
$pdf->line(326.6,13.5,326.6,26.25);
$pdf->line(368.2,13.5,368.2,26.25);
$pdf->line(238.2,26.25,238.2,29.25);
$pdf->line(370.8,26.25,370.8,34.75);
$pdf->line(381.2,26.25,381.2,34.75);
$pdf->line(391.6,26.25,391.6,34.75);
$pdf->line(402,26.25,402,34.75);
$pdf->line(415,26.25,415,34.75);
$pdf->SetLineWidth(0.8);
$pdf->rect(266.8,13.5,148.2,12.75);
$pdf->SetLineWidth(0.2);
// Рамка Б2Ф1 ГОСТ 3.1103-2011 Исполнители
$pdf->rect(129,13.5,96.2,21.25);
$pdf->line(129,17.75,225.2,17.75);
$pdf->line(129,22,225.2,22);
$pdf->line(129,26.25,225.2,26.25);
$pdf->line(129,30.5,225.2,30.5);
$pdf->line(152.4,13.5,152.4,34.75);
$pdf->line(188.8,13.5,188.8,34.75);
$pdf->line(209.6,13.5,209.6,34.75);
//Задаем шрифт
//$pdf->SetFont('arial','',8);
$pdf->setxy(129,13.5);
$pdf->SetFont('gost_a','',12);
//В ячейке 23.4х4.25 мм с разрывом строк выравнивание текста задаем по левой стороне
$pdf->Cell(23.4,4.25,'Разраб.',0,2,'L');
$pdf->Cell(23.4,4.25,'Проверил',0,2,'L');
$pdf->Cell(23.4,4.25,'Утвердил',0,2,'L');
$pdf->Cell(23.4,4.25,'',0,2,'L');
//$pdf->SetXY(5.5,48.5);
$pdf->Cell(23.4,4.25,'Н.контр.');
$pdf->SetXY(209.6,13.5);
$pdf->Cell(15.6,4.25,$today,0,1,'C');
$pdf->SetXY(373,1);
$pdf->Cell(40,4.25,'ГОСТ 3.1105-2011 Форма 8а',0,1,'R');
$pdf->line(0,297/2,5,297/2);
//ГОСТ 3.1105-2011 КЭ Форма 8 (Заглавный лист)
$pdf->AddFont('gost_a','','GOSTmi.php');
$pdf->SetFont('gost_a','',12);
$pdf->SetAutoPageBreak(true,0);
$pdf->SetMargins(5,0,5);
$pdf->SetTextColor( 0, 0, 0);
$pdf->AddPage();
// Рамка B6Ф1 ГОСТ 3.1103-82 блок вида и назначения документа
$pdf->rect(20,283.5,395,8.5);
$pdf->rect(20,283.5,23.5,8.5);
	$pdf->SetFont('gost_a','',15);	
	$pdf->SetXY(20,283.5);
	$pdf->Cell(23.5,8.5,'КЭ',0,0,'C');
	$pdf->Cell(356,8.5,'Карта эскизов',0,0,'L');
	$pdf->Cell(15.6,8.5,$pdf->PageNo(),0,0,'C');
$pdf->rect(399.4,283.5,15.6,8.5);
//Данные
$pdf->SetFont('gost_a','',12);
$pdf->rect(20,26.25,395,257.25);
// Рамка Б5Ф1а ГОСТ 3.1103-2011 блок вспомогательной информации
$pdf->rect(20,5,395,8.5);
$pdf->line(292.8,5,292.8,8);
$pdf->line(352.6,5,352.6,13.5);
$pdf->line(399.4,5,399.4,13.5);
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$pdf->rect(7.25,216.6,12.75,75.4);
$pdf->line(7.25,232.2,11.5,232.2);
$pdf->line(15.75,232.2,20,232.2);
$pdf->line(7.25,248,11.5,248);
$pdf->line(15.75,248,20,248);
$pdf->line(7.25,268.8,20,268.8);
$pdf->line(11.5,216.6,11.5,292);
$pdf->line(15.75,216.6,15.75,292);
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(3,5,17,80.6);
$pdf->line(7.25,5,7.25,85.6);
$pdf->line(11.5,5,11.5,85.6);
$pdf->line(15.75,5,15.75,85.6);
$pdf->line(3,20.6,20,20.6);
$pdf->line(3,41.4,20,41.4);
$pdf->line(3,64.8,20,64.8);
$pdf->line(3,75.2,20,75.2);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(11.5,85.6,8.5,80.6);
$pdf->line(15.75,85.6,15.75,166.2);
$pdf->line(11.5,101.2,20,101.2);
$pdf->line(11.5,122,20,122);
$pdf->line(11.5,145.4,20,145.4);
$pdf->line(11.5,155.8,20,155.8);
// Рамка Б1Ф3а ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$pdf->rect(295.4,13.5,119.6,12.75);
$pdf->line(355.2,13.5,355.2,26.25);
$pdf->line(402,13.5,402,26.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(214.8,13.5,80.6,12.75);
$pdf->line(214.8,17.75,295.4,17.75);
$pdf->line(214.8,22,295.4,22);
$pdf->line(225.2,13.5,225.2,26.25);
$pdf->line(235.6,13.5,235.6,26.25);
$pdf->line(259,13.5,259,26.25);
$pdf->line(279.8,13.5,279.8,26.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(134.2,13.5,80.6,12.75);
$pdf->line(134.2,17.75,214.8,17.75);
$pdf->line(134.2,22,214.8,22);
$pdf->line(144.6,13.5,144.6,26.25);
$pdf->line(155,13.5,155,26.25);
$pdf->line(178.4,13.5,178.4,26.25);
$pdf->line(199.2,13.5,199.2,26.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(53.6,13.5,80.6,12.75);
$pdf->line(53.6,17.75,134.2,17.75);
$pdf->line(53.6,22,134.2,22);
$pdf->line(64,13.5,64,26.25);
$pdf->line(74.4,13.5,74.4,26.25);
$pdf->line(97.8,13.5,97.8,26.25);
$pdf->line(118.6,13.5,118.6,26.25);
//  Выводим PDF

$pdf->Output( "report.pdf", "I" );
?>