<?php
define('FPDF_FONTPATH','../font/');
require_once( "fpdf.php" );
$pdf = new FPDF( 'L', 'mm','A4');
$today=date("d.m.y");
//ГОСТ 3.1105-84 КЭ Форма 7 (Заглавный лист)
$pdf->AddFont('gost_a','','GOSTmi.php');
$pdf->SetFont('gost_a','',12);
$pdf->SetAutoPageBreak(true,0);
$pdf->SetMargins(5.5,0,5.5);
$pdf->SetTextColor( 0, 0, 0);
$pdf->AddPage();
// Рамка B6Ф1 ГОСТ 3.1103-82 блок вида и назначения документа
$pdf->rect(5.5,201.5,286,8.5);
$pdf->rect(5.5,201.5,23.5,8.5);
	$pdf->SetFont('gost_a','',15);	
	$pdf->SetXY(5.5,201.5);
	$pdf->Cell(23.5,8.5,'КН',0,0,'C');
	$pdf->Cell(246.9,8.5,'Карта наладки',0,0,'L');
	$pdf->Cell(15.6,8.5,$pdf->PageNo(),0,0,'C');
$pdf->rect(297-5.5-15.6,201.5,15.6,8.5);
//Данные
$pdf->SetFont('gost_a','',12);
$pdf->rect(5.5,52.75,286,148.75);

// Рамка Б5Ф1 ГОСТ 3.1103-2011 блок вспомогательной информации
$pdf->rect(5.5,23,286,8.5);
$pdf->line(275.9,23,275.9,31.5);
$pdf->line(260.3,23,260.3,31.5);
$pdf->line(213.5,23,213.5,31.5);
$pdf->line(153.7,23,153.7,26);
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$pdf->rect(5.5,10.25,75.4,12.75);
$pdf->line(5.5,14.5,80.9,14.5);
$pdf->line(5.5,18.75,80.9,18.75);
$pdf->line(23.7,10.25,23.7,14.5);
$pdf->line(44.5,10.25,44.5,14.5);
$pdf->line(65.3,10.25,65.3,14.5);
$pdf->line(23.7,18.75,23.7,23);
$pdf->line(44.5,18.75,44.5,23);
$pdf->line(65.3,18.75,65.3,23);
$pdf->setxy(5.5,10.25);
$pdf->SetFont('gost_a','',12);
$pdf->Cell(18.2,4.25,'Дубл.',1,2,'L');
$pdf->Cell(18.2,4.25,'Взам.',1,2,'L');
$pdf->Cell(18.2,4.25,'Подп.',1,2,'L');
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(210.9,6,80.6,17);
$pdf->line(210.9,10.25,291.5,10.25);
$pdf->line(210.9,14.5,291.5,14.5);
$pdf->line(210.9,18.75,291.5,18.75);
$pdf->line(221.3,6,221.3,23);
$pdf->line(231.6,6,231.6,23);
$pdf->line(255.1,6,255.1,23);
$pdf->line(275.9,6,275.9,23);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(130.3,14.5,80.6,8.5);
$pdf->line(130.3,18.75,210.9,18.75);
$pdf->line(140.7,14.5,140.7,23);
$pdf->line(151.1,14.5,151.1,23);
$pdf->line(174.5,14.5,174.5,23);
$pdf->line(195.3,14.5,195.3,23);
// Рамка Б1Ф3 ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$pdf->rect(101.7,31.5,189.8,21.25);
$pdf->line(101.7,44.25,291.5,44.25);
$pdf->line(143.3,31.5,143.3,44.25);
$pdf->line(203.1,31.5,203.1,44.25);
$pdf->line(244.7,31.5,244.7,44.25);
$pdf->line(114.7,44.5,114.7,46.5);
$pdf->line(278.5,44.25,278.5,52.75);
$pdf->line(268.1,44.25,268.1,52.75);
$pdf->line(257.7,44.25,257.7,52.75);
$pdf->line(247.3,44.25,247.3,52.75);
$pdf->SetLineWidth(0.8);
$pdf->rect(143.3,31.5,148.2,12.75);
$pdf->SetLineWidth(0.2);
// Рамка Б2Ф1 ГОСТ 3.1103-2011 Исполнители
$pdf->rect(5.5,31.5,96.2,21.25);
$pdf->line(28.9,31.5,28.9,52.75);
$pdf->line(60.3,31.5,60.3,52.75);
$pdf->line(86.1,31.5,86.1,52.75);
$pdf->line(5.5,35.75,101.2,35.75);
$pdf->line(5.5,40,101.7,40);
$pdf->line(5.5,44.25,101.7,44.25);
$pdf->line(5.5,48.5,101.7,48.5);
//Задаем шрифт
//$pdf->SetFont('arial','',8);
$pdf->setxy(5.5,31.5);
$pdf->SetFont('gost_a','',12);
//В ячейке 23.4х4.25 мм с разрывом строк выравнивание текста задаем по левой стороне
$pdf->Cell(23.4,4.25,'Разраб.',0,2,'L');
$pdf->Cell(23.4,4.25,'Проверил',0,2,'L');
$pdf->Cell(23.4,4.25,'Утвердил',0,2,'L');
$pdf->Cell(23.4,4.25,'',0,2,'L');
//$pdf->SetXY(5.5,48.5);
$pdf->Cell(23.4,4.25,'Н.контр.');
$pdf->SetXY(86.1,31.5);
$pdf->Cell(15.6,4.25,$today,0,1,'C');
$pdf->SetXY(250,2);
$pdf->Cell(40,4.25,'ГОСТ 3.1105-84 Форма 7',0,1,'R');
$pdf->line(148.5,3,148.5,11);
//
$pdf->line(5.5,57,291.5,57);
$pdf->line(5.5,65.5,291.5,65.5);
$pdf->line(5.5,74,291.5,74);
$pdf->line(5.5,82.5,291.5,82.5);
$pdf->line(5.5,91,291.5,91);
$pdf->line(5.5,99.5,291.5,99.5);
$pdf->line(5.5,108,291.5,108);
$pdf->line(5.5,116.5,291.5,116.5);
$pdf->line(5.5,125,291.5,125);
$pdf->line(5.5,129.25,291.5,129.25);
$pdf->line(5.5,133.5,291.5,133.5);
$pdf->line(5.5,137.75,291.5,137.75);
$pdf->line(60,125,60,137.75);
$pdf->line(131.5,125,131.5,137.75);
$pdf->line(203,125,203,137.75);
$pdf->line(274.5,125,274.5,137.75);

$pdf->line(77,52.75,77,201.5);
$pdf->line(148.5,52.75,148.5,201.5);
$pdf->line(220,52.75,220,201.5);

$pdf->setxy(5.5,125);
$pdf->Cell(54.5,4.25,'Рабочая позиция',0,2,'L');
$pdf->Cell(54.5,4.25,'Вылет инструмента (L)',0,2,'L');
$pdf->Cell(54.5,4.25,'Время работы, мин',0,2,'L');
$pdf->setxy(77,125);
$pdf->Cell(54.5,4.25,'Рабочая позиция',0,2,'L');
$pdf->Cell(54.5,4.25,'Вылет инструмента (L)',0,2,'L');
$pdf->Cell(54.5,4.25,'Время работы, мин',0,2,'L');
$pdf->setxy(148.5,125);
$pdf->Cell(54.5,4.25,'Рабочая позиция',0,2,'L');
$pdf->Cell(54.5,4.25,'Вылет инструмента (L)',0,2,'L');
$pdf->Cell(54.5,4.25,'Время работы, мин',0,2,'L');
$pdf->setxy(220,125);
$pdf->Cell(54.5,4.25,'Рабочая позиция',0,2,'L');
$pdf->Cell(54.5,4.25,'Вылет инструмента (L)',0,2,'L');
$pdf->Cell(54.5,4.25,'Время работы, мин',0,2,'L');
//вывод текста
$pdf->setxy(5.5,52.75);
$pdf->Cell(71.5,4.25,'1',0,2,'C');
$pdf->SetFont('gost_a','',10);
$pdf->setxy(5.5,57);
$pdf->MultiCell(71.5+60,4.25,'M58342820 Удлинитель с гидропластовым патроном SECO',0,'L');
$pdf->setxy(5.5,65.5);
$pdf->MultiCell(71.5+60,4.25,'218.20-150ER-ME07 MS2050 Пластина SECO',0,'L');
$pdf->SetFont('gost_a','',12);
$pdf->setxy(60,125);
$pdf->Cell(11.5,4.25,'T01',0,2,'L');
$pdf->Cell(11.5,4.25,'125',0,2,'L');
$pdf->Cell(11.5,4.25,'10.54',0,2,'L');
$pdf->Image('..\img\КНИ1.png',5.5+0.25,137.75+0.25,71,63.5);
//_________________________________________________________
//второй лист КЭ форма 7а ГОСТ 3.1105-84
$pdf->AddPage();
// Рамка B6Ф1 ГОСТ 3.1103-2011 блок вида и назначения документа
$pdf->rect(5.5,201.5,286,8.5);
$pdf->rect(5.5,201.5,23.5,8.5);
	//$pdf->AddFont('gost_a','','GOSTmi.php');
	$pdf->SetFont('gost_a','',15);	
	$pdf->SetXY(5.5,201.5);
	$pdf->Cell(23.5,8.5,'КН',0,0,'C');
	$pdf->Cell(246.9,8.5,'Карта наладки',0,0,'L');
	$pdf->Cell(15.6,8.5,$pdf->PageNo(),0,0,'C');
$pdf->rect(297-5.5-15.6,201.5,15.6,8.5);
//Данные
$pdf->SetFont('gost_a','',12);
$pdf->rect(5.5,44.25,286,157.25);

// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$pdf->rect(5.5,10.25,75.4,12.75);
$pdf->line(5.5,14.5,80.9,14.5);
$pdf->line(5.5,18.75,80.9,18.75);
$pdf->line(23.7,10.25,23.7,14.5);
$pdf->line(44.5,10.25,44.5,14.5);
$pdf->line(65.3,10.25,65.3,14.5);
$pdf->line(23.7,18.75,23.7,23);
$pdf->line(44.5,18.75,44.5,23);
$pdf->line(65.3,18.75,65.3,23);
$pdf->setxy(5.5,10.25);
$pdf->SetFont('gost_a','',12);
$pdf->Cell(18.2,4.25,'Дубл.',1,2,'L');
$pdf->Cell(18.2,4.25,'Взам.',1,2,'L');
$pdf->Cell(18.2,4.25,'Подп.',1,2,'L');
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(210.9,6,80.6,17);
$pdf->line(210.9,10.25,291.5,10.25);
$pdf->line(210.9,14.5,291.5,14.5);
$pdf->line(210.9,18.75,291.5,18.75);
$pdf->line(221.3,6,221.3,23);
$pdf->line(231.6,6,231.6,23);
$pdf->line(255.1,6,255.1,23);
$pdf->line(275.9,6,275.9,23);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(130.3,14.5,80.6,8.5);
$pdf->line(130.3,18.75,210.9,18.75);
$pdf->line(140.7,14.5,140.7,23);
$pdf->line(151.1,14.5,151.1,23);
$pdf->line(174.5,14.5,174.5,23);
$pdf->line(195.3,14.5,195.3,23);
// Рамка Б1Ф3а ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$pdf->rect(171.9,31.5,119.6,12.75);
$pdf->line(278.5,31.5,278.5,44.25);
$pdf->line(231.7,31.5,231.7,44.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(91.3,31.5,80.6,12.75);
$pdf->line(91.3,35.75,171.9,35.75);
$pdf->line(91.3,40,171.9,40);
$pdf->line(156.3,31.5,156.3,44.25);
$pdf->line(135.5,31.5,135.5,44.25);
$pdf->line(112.1,31.5,112.1,44.25);
$pdf->line(101.7,31.5,101.7,44.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(10.7,31.5,80.6,12.75);
$pdf->line(10.7,35.75,91.3,35.75);
$pdf->line(10.7,40,91.3,40);
$pdf->line(75.7,31.5,75.7,44.25);
$pdf->line(54.9,31.5,54.9,44.25);
$pdf->line(31.5,31.5,31.5,44.25);
$pdf->line(21.1,31.5,21.1,44.25);
$pdf->rect(5.5,31.5,5.2,12.75);
// Рамка Б5Ф1а ГОСТ 3.1103-2011 блок вспомогательной информации
$pdf->rect(5.5,23,286,8.5);
$pdf->line(275.9,23,275.9,31.5);
$pdf->line(229.1,23,229.1,31.5);
$pdf->line(169.3,23,169.3,26);
$pdf->SetXY(250,2);
$pdf->Cell(40,4.25,'ГОСТ 3.1105-84 Форма 7а',0,1,'R');
//$pdf->SetXY(210,4);
//$pdf->write(0,'ГОСТ 3.1105-84 Форма 7а');
$pdf->line(148.5,3,148.5,11);
//
$pdf->line(5.5,48.5,291.5,48.5);
$pdf->line(5.5,57,291.5,57);
$pdf->line(5.5,65.5,291.5,65.5);
$pdf->line(5.5,74,291.5,74);
$pdf->line(5.5,82.5,291.5,82.5);
$pdf->line(5.5,91,291.5,91);
$pdf->line(5.5,99.5,291.5,99.5);
$pdf->line(5.5,108,291.5,108);
$pdf->line(5.5,116.5,291.5,116.5);
$pdf->line(5.5,125,291.5,125);
$pdf->line(5.5,129.25,291.5,129.25);
$pdf->line(5.5,133.5,291.5,133.5);
$pdf->line(5.5,137.75,291.5,137.75);
$pdf->line(60,125,60,137.75);
$pdf->line(131.5,125,131.5,137.75);
$pdf->line(203,125,203,137.75);
$pdf->line(274.5,125,274.5,137.75);

$pdf->line(77,44.25,77,201.5);
$pdf->line(148.5,44.25,148.5,201.5);
$pdf->line(220,44.25,220,201.5);

$pdf->setxy(5.5,125);
$pdf->Cell(54.5,4.25,'Рабочая позиция',0,2,'L');
$pdf->Cell(54.5,4.25,'Вылет инструмента (L)',0,2,'L');
$pdf->Cell(54.5,4.25,'Время работы, мин',0,2,'L');
$pdf->setxy(77,125);
$pdf->Cell(54.5,4.25,'Рабочая позиция',0,2,'L');
$pdf->Cell(54.5,4.25,'Вылет инструмента (L)',0,2,'L');
$pdf->Cell(54.5,4.25,'Время работы, мин',0,2,'L');
$pdf->setxy(148.5,125);
$pdf->Cell(54.5,4.25,'Рабочая позиция',0,2,'L');
$pdf->Cell(54.5,4.25,'Вылет инструмента (L)',0,2,'L');
$pdf->Cell(54.5,4.25,'Время работы, мин',0,2,'L');
$pdf->setxy(220,125);
$pdf->Cell(54.5,4.25,'Рабочая позиция',0,2,'L');
$pdf->Cell(54.5,4.25,'Вылет инструмента (L)',0,2,'L');
$pdf->Cell(54.5,4.25,'Время работы, мин',0,2,'L');
//вывод текста
$pdf->setxy(5.5,44.25);
$pdf->Cell(71.5,4.25,'5',0,2,'C');
//  Выводим PDF

$pdf->Output( "report.pdf", "I" );
?>