<?php
define('FPDF_FONTPATH','../font/');
$today=date("d.m.Y");
require_once( "fpdf.php" );
//ГОСТ 3.1118-86 МК Форма 1 (Заглавный лист)
$pdf = new FPDF( 'L', 'mm','A4');
$pdf->AddFont('gost_a','','GOSTmi.php');
$pdf->SetFont('gost_a','',12);
$pdf->SetAutoPageBreak(true,0);
$pdf->SetMargins(5.5,0,5.5);
	
$pdf->SetTextColor( 0, 0, 0);
$pdf->AddPage();
// Рамка B6Ф1 ГОСТ 3.1103-82 блок вида и назначения документа
$pdf->rect(5.5,201.5,286,8.5);
$pdf->rect(5.5,201.5,23.5,8.5);
	$pdf->SetFont('gost_a','',15);	
	$pdf->SetXY(5.5,201.5);
	$pdf->Cell(23.5,8.5,'МK',0,0,'C');
	$pdf->Cell(200,8.5,'Маршрутная карта',0,0,'L');
//Данные
$pdf->SetFont('gost_a','',12);
$pdf->rect(5.5,82.5,286,119);
for ($x=0; $x++<14;){ 
	$pdf->line(5.5,$x*8.5+82.5,286+5.5,$x*8.5+82.5);
	$pdf->line(5.5+13,$x*8.5+82.5-8.5,5.5+13,82.5+$x*8.5);
	$pdf->setxy(5.5,$x*8.5+82.5-8.5);
	$pdf->cell(13,8.5,sprintf('%02d',$x+2),0,1,'R');
}
$pdf->setXY(5.5,78.25);
$pdf->cell(13,4.25,'Б',1,0,'C');
$pdf->cell(119.6,4.25,'Код, наименование оборудования',1,0,'C');
$pdf->cell(10.4,4.25,'СМ',1,0,'C');
$pdf->cell(18.2,4.25,'Проф.',1,0,'C');
$pdf->cell(10.4,4.25,'Р',1,0,'C');
$pdf->cell(13,4.25,'УТ',1,0,'C');
$pdf->cell(10.4,4.25,'КР',1,0,'C');
$pdf->cell(13,4.25,'КОИД',1,0,'C');
$pdf->cell(13,4.25,'ЕН',1,0,'C');
$pdf->cell(13,4.25,'ОП',1,0,'C');
$pdf->cell(13,4.25,'Кшт.',1,0,'C');
$pdf->cell(18.2,4.25,'Тпз',1,0,'C');
$pdf->cell(20.8,4.25,'Тшт.',1,0,'C');
$pdf->setXY(5.5,74);
$pdf->cell(13,4.25,'А',1,0,'C');
$pdf->cell(10.4,4.25,'Цех',1,0,'C');
$pdf->cell(10.4,4.25,'Уч.',1,0,'C');
$pdf->cell(10.4,4.25,'РМ',1,0,'C');
$pdf->cell(13,4.25,'Опер.',1,0,'C');
$pdf->cell(75.4,4.25,'Код, наименование операции',1,0,'C');
$pdf->cell(153.4,4.25,'Обозначение документа',1,0,'C');
$pdf->setXY(5.5,52.75);
$pdf->cell(13,8.5,'М01',1,0,'C');
$pdf->rect(18.5,52.75,231.4,8.5);
$pdf->rect(249.9,52.75,41.6,21.25);
$pdf->rect(5.5,61.25,13,12.75);
$pdf->setXY(5.5,65.5);
$pdf->cell(13,8.5,'М02',0,0,'C');
$pdf->setXY(18.5,61.25);
$pdf->cell(33.8,4.25,'Код',1,0,'C');
$pdf->cell(10.4,4.25,'ЕВ',1,0,'C');
$pdf->cell(18.2,4.25,'МД',1,0,'C');
$pdf->cell(15.6,4.25,'ЕН',1,0,'C');
$pdf->cell(18.2,4.25,'Н.расх.',1,0,'C');
$pdf->cell(13,4.25,'КИМ',1,0,'C');
$pdf->cell(33.8,4.25,'Код заготовки',1,0,'C');
$pdf->cell(54.6,4.25,'Профиль и размеры',1,0,'C');
$pdf->cell(15.6,4.25,'КД',1,0,'C');
$pdf->cell(18.2,4.25,'МЗ',1,0,'C');
$pdf->line(52.3,65.5,52.3,74);
$pdf->line(62.7,65.5,62.7,74);
$pdf->line(80.9,65.5,80.9,74);
$pdf->line(96.5,65.5,96.5,74);
$pdf->line(114.7,65.5,114.7,74);
$pdf->line(127.7,65.5,127.7,74);
$pdf->line(161.5,65.5,161.5,74);
$pdf->line(216.1,65.5,216.1,74);
$pdf->line(231.7,65.5,231.7,74);
$pdf->SetLineWidth(0.8);
$pdf->rect(18.5,65.5,96.2,8.5);
$pdf->rect(127.7,65.5,33.8,8.5);
$pdf->rect(216.1,65.5,33.8,8.5);
$pdf->rect(18.5,74,273,8.5);
$pdf->SetLineWidth(0.2);
// Рамка Б5Ф1 ГОСТ 3.1103-2011 блок вспомогательной информации
$pdf->rect(5.5,23,286,8.5);
$pdf->line(275.9,23,275.9,31.5);
$pdf->line(260.3,23,260.3,31.5);
$pdf->line(213.5,23,213.5,31.5);
$pdf->line(153.7,23,153.7,26);
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$pdf->rect(5.5,10.25,75.4,12.75);
$pdf->line(5.5,14.5,80.9,14.5);
$pdf->line(5.5,18.75,80.9,18.75);
$pdf->line(23.7,10.25,23.7,14.5);
$pdf->line(44.5,10.25,44.5,14.5);
$pdf->line(65.3,10.25,65.3,14.5);
$pdf->line(23.7,18.75,23.7,23);
$pdf->line(44.5,18.75,44.5,23);
$pdf->line(65.3,18.75,65.3,23);
$pdf->setxy(5.5,10.25);
$pdf->SetFont('gost_a','',12);
$pdf->Cell(18.2,4.25,'Дубл.',1,2,'L');
$pdf->Cell(18.2,4.25,'Взам.',1,2,'L');
$pdf->Cell(18.2,4.25,'Подл.',1,2,'L');
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(210.9,6,80.6,17);
$pdf->line(210.9,10.25,291.5,10.25);
$pdf->line(210.9,14.5,291.5,14.5);
$pdf->line(210.9,18.75,291.5,18.75);
$pdf->line(221.3,6,221.3,23);
$pdf->line(231.6,6,231.6,23);
$pdf->line(255.1,6,255.1,23);
$pdf->line(275.9,6,275.9,23);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(130.3,14.5,80.6,8.5);
$pdf->line(130.3,18.75,210.9,18.75);
$pdf->line(140.7,14.5,140.7,23);
$pdf->line(151.1,14.5,151.1,23);
$pdf->line(174.5,14.5,174.5,23);
$pdf->line(195.3,14.5,195.3,23);
// Рамка Б1Ф1 ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$pdf->rect(101.7,31.5,189.8,21.25);
$pdf->line(101.7,44.25,291.5,44.25);
$pdf->line(143.3,31.5,143.3,44.25);
$pdf->line(203.1,31.5,203.1,44.25);
$pdf->line(244.7,31.5,244.7,44.25);
$pdf->line(114.7,44.5,114.7,46.5);
$pdf->line(281.1,44.25,281.1,52.75);
$pdf->line(270.7,44.25,270.7,52.75);
$pdf->line(260.3,44.25,260.3,52.75);
$pdf->SetLineWidth(0.8);
$pdf->rect(143.3,31.5,148.2,12.75);
$pdf->SetLineWidth(0.2);
// Рамка Б2Ф1 ГОСТ 3.1103-2011 Исполнители
$pdf->rect(5.5,31.5,96.2,21.25);
$pdf->line(33.9,31.5,33.9,52.75);
$pdf->line(65.3,31.5,65.3,52.75);
$pdf->line(81.1,31.5,81.1,52.75);
$pdf->line(5.5,35.75,101.2,35.75);
$pdf->line(5.5,40,101.7,40);
$pdf->line(5.5,44.25,101.7,44.25);
$pdf->line(5.5,48.5,101.7,48.5);
//Задаем шрифт
//$pdf->SetFont('arial','',8);
$pdf->setxy(5.5,31.5);
$pdf->SetFont('gost_a','',12);
//В ячейке 23.4х4.25 мм с разрывом строк выравнивание текста задаем по левой стороне
$pdf->Cell(23.4,4.25,'Разраб.',0,2,'L');
$pdf->Cell(23.4,4.25,'Проверил',0,2,'L');
$pdf->Cell(23.4,4.25,'Утвердил',0,2,'L');
$pdf->Cell(23.4,4.25,'',0,2,'L');
//$pdf->SetXY(5.5,48.5);
$pdf->Cell(23.4,4.25,'Н.контр.');
$pdf->SetXY(83,31.5);
$pdf->Cell(15.6,4.25,$today,0,1,'C');
$pdf->SetXY(223,4);
$pdf->write(0,'ГОСТ 3.1118-82 Форма 1');
$pdf->line(148.5,3,148.5,11);
//_________________________________________________________
//второй лист МК форма 1б ГОСТ 3.1118-82
$pdf->AddPage();
// Рамка B6Ф1 ГОСТ 3.1103-2011 блок вида и назначения документа
$pdf->rect(5.5,201.5,286,8.5);
$pdf->rect(5.5,201.5,23.5,8.5);
	$pdf->SetFont('gost_a','',15);	
	$pdf->SetXY(5.5,201.5);
	$pdf->Cell(23.5,8.5,'МК',0,0,'C');
	$pdf->Cell(200,8.5,'Маршрутная карта',0,0,'L');
$pdf->rect(297-5.5-15.6,201.5,15.6,8.5);
//Данные
$pdf->SetFont('gost_a','',12);
$pdf->rect(5.5,57,286,144.5);
for ($x=0; $x++<17;){ 
	$pdf->line(5.5,$x*8.5+57,286+5.5,$x*8.5+57);
	$pdf->line(5.5+13,$x*8.5+57-8.5,5.5+13,57+$x*8.5);
	$pdf->setxy(5.5,$x*8.5+57-8.5);
	$pdf->cell(13,8.5,sprintf('%02d',$x),0,1,'R');
}
$pdf->setXY(5.5,44.25);
$pdf->cell(13,4.25,'А',1,0,'C');
$pdf->cell(10.4,4.25,'Цех',1,0,'C');
$pdf->cell(10.4,4.25,'Уч.',1,0,'C');
$pdf->cell(10.4,4.25,'РМ',1,0,'C');
$pdf->cell(13,4.25,'Опер.',1,0,'C');
$pdf->cell(75.4,4.25,'Код, наименование операции',1,0,'C');
$pdf->cell(153.4,4.25,'Обозначение документа',1,0,'C');
$pdf->setXY(5.5,48.5);
$pdf->cell(13,4.25,'Б',1,0,'C');
$pdf->cell(119.6,4.25,'Код, наименование оборудования',1,0,'C');
$pdf->cell(10.4,4.25,'СМ',1,0,'C');
$pdf->cell(18.2,4.25,'Проф.',1,0,'C');
$pdf->cell(10.4,4.25,'Р',1,0,'C');
$pdf->cell(13,4.25,'УТ',1,0,'C');
$pdf->cell(10.4,4.25,'КР',1,0,'C');
$pdf->cell(13,4.25,'КОИД',1,0,'C');
$pdf->cell(13,4.25,'ЕН',1,0,'C');
$pdf->cell(13,4.25,'ОП',1,0,'C');
$pdf->cell(13,4.25,'Кшт.',1,0,'C');
$pdf->cell(18.2,4.25,'Тпз',1,0,'C');
$pdf->cell(20.8,4.25,'Тшт.',1,0,'C');
$pdf->setXY(5.5,52.75);
$pdf->cell(13,4.25,'К/М',1,0,'C');
$pdf->cell(119.6,4.25,'Наименование детали, сб.единицы или материала',1,0,'C');
$pdf->cell(75.4,4.25,'Обозначение, код',1,0,'C');
$pdf->cell(13,4.25,'ОПП',1,0,'C');
$pdf->cell(13,4.25,'ЕВ',1,0,'C');
$pdf->cell(13,4.25,'ЕН',1,0,'C');
$pdf->cell(18.2,4.25,'КИ',1,0,'C');
$pdf->cell(20.8,4.25,'Н.расх.',1,0,'C');
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$pdf->rect(5.5,10.25,75.4,12.75);
$pdf->line(5.5,14.5,80.9,14.5);
$pdf->line(5.5,18.75,80.9,18.75);
$pdf->line(23.7,10.25,23.7,14.5);
$pdf->line(44.5,10.25,44.5,14.5);
$pdf->line(65.3,10.25,65.3,14.5);
$pdf->line(23.7,18.75,23.7,23);
$pdf->line(44.5,18.75,44.5,23);
$pdf->line(65.3,18.75,65.3,23);
$pdf->setxy(5.5,10.25);
$pdf->SetFont('gost_a','',12);
$pdf->Cell(18.2,4.25,'Дубл.',1,2,'L');
$pdf->Cell(18.2,4.25,'Взам.',1,2,'L');
$pdf->Cell(18.2,4.25,'Подл.',1,2,'L');
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(210.9,6,80.6,17);
$pdf->line(210.9,10.25,291.5,10.25);
$pdf->line(210.9,14.5,291.5,14.5);
$pdf->line(210.9,18.75,291.5,18.75);
$pdf->line(221.3,6,221.3,23);
$pdf->line(231.6,6,231.6,23);
$pdf->line(255.1,6,255.1,23);
$pdf->line(275.9,6,275.9,23);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(130.3,14.5,80.6,8.5);
$pdf->line(130.3,18.75,210.9,18.75);
$pdf->line(140.7,14.5,140.7,23);
$pdf->line(151.1,14.5,151.1,23);
$pdf->line(174.5,14.5,174.5,23);
$pdf->line(195.3,14.5,195.3,23);
// Рамка Б1Ф1а ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$pdf->rect(184.9,31.5,106.6,12.75);
$pdf->line(244.7,31.5,244.7,44.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(104.3,31.5,80.6,12.75);
$pdf->line(104.3,35.75,184.9,35.75);
$pdf->line(104.3,40,184.9,40);
$pdf->line(169.3,31.5,169.3,44.25);
$pdf->line(148.5,31.5,148.5,44.25);
$pdf->line(125.1,31.5,125.1,44.25);
$pdf->line(114.7,31.5,114.7,44.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$pdf->rect(23.7,31.5,80.6,12.75);
$pdf->line(23.7,35.75,104.3,35.75);
$pdf->line(23.7,40,104.3,40);
$pdf->line(88.7,31.5,88.7,44.25);
$pdf->line(67.9,31.5,67.9,44.25);
$pdf->line(44.5,31.5,44.5,44.25);
$pdf->line(34.1,31.5,34.1,44.25);
$pdf->rect(5.5,31.5,18.2,12.75);
// Рамка Б5Ф1а ГОСТ 3.1103-2011 блок вспомогательной информации
$pdf->rect(5.5,23,286,8.5);
$pdf->line(275.9,23,275.9,31.5);
$pdf->line(229.1,23,229.1,31.5);
$pdf->line(169.3,23,169.3,26);
$pdf->SetLineWidth(0.8);
$pdf->line(5.5,44.25,291.5,44.25);
$pdf->line(291.5,44.25,291.5,57);
$pdf->line(291.5,57,138.1,57);
$pdf->line(138.1,57,138.1,52.75);
$pdf->line(138.1,52.75,5.5,52.75);
$pdf->line(5.5,44.25,5.5,52.75);
$pdf->SetLineWidth(0.2);
$pdf->SetXY(218,4);
$pdf->write(0,'ГОСТ 3.1118-82 Форма 1б');
$pdf->line(148.5,3,148.5,11);

/***
  Выводим PDF
***/
$pdf->Output( "report.pdf", "I" );
?>