<?php
class MK1 extends FPDF{
//$text = iconv('utf-8', 'windows-1251', $text);
//const DIAM=array("\u{2300}",'ø');
function Special($perehod, $y){
	$perehod=str_replace("\u{2220}",iconv('windows-1251', 'utf-8',chr(167)),$perehod);//∠
	$perehod=str_replace("\u{25A1}",iconv('windows-1251', 'utf-8',chr(186)),$perehod);//□
	$perehod=str_replace("\u{25BA}",iconv('windows-1251', 'utf-8',chr(170)),$perehod);//►
	$perehod=str_replace("\u{00D7}",iconv('windows-1251', 'utf-8',chr(175)),$perehod);//×
	$perehod=str_replace("\u{2219}",iconv('windows-1251', 'utf-8',chr(149)),$perehod);//∙
	$perehod=str_replace("\u{03B1}",iconv('windows-1251', 'utf-8',chr(131)),$perehod);//α
	$perehod=str_replace("\u{03B2}",iconv('windows-1251', 'utf-8',chr(132)),$perehod);//β
	$perehod=str_replace("\u{03B3}",iconv('windows-1251', 'utf-8',chr(133)),$perehod);//γ
	$perehod=str_replace("\u{03B4}",iconv('windows-1251', 'utf-8',chr(134)),$perehod);//δ
	$perehod=str_replace("\u{03B5}",iconv('windows-1251', 'utf-8',chr(135)),$perehod);//ε
	$perehod=str_replace("\u{03B6}",iconv('windows-1251', 'utf-8',chr(136)),$perehod);//ζ
	$perehod=str_replace("\u{03B7}",iconv('windows-1251', 'utf-8',chr(137)),$perehod);//η
	$perehod=str_replace("\u{03B8}",iconv('windows-1251', 'utf-8',chr(138)),$perehod);//θ
	$perehod=str_replace("\u{03B9}",iconv('windows-1251', 'utf-8',chr(139)),$perehod);//ι
	$perehod=str_replace("\u{03BA}",iconv('windows-1251', 'utf-8',chr(140)),$perehod);//κ
	$perehod=str_replace("\u{03BB}",iconv('windows-1251', 'utf-8',chr(141)),$perehod);//λ
	$perehod=str_replace("\u{03BC}",iconv('windows-1251', 'utf-8',chr(142)),$perehod);//μ
	$perehod=str_replace("\u{03BD}",iconv('windows-1251', 'utf-8',chr(143)),$perehod);//ν
	$perehod=str_replace("\u{03BE}",iconv('windows-1251', 'utf-8',chr(144)),$perehod);//ξ
	$perehod=str_replace("\u{03BF}",iconv('windows-1251', 'utf-8',chr(145)),$perehod);//ο
	$perehod=str_replace("\u{03C0}",iconv('windows-1251', 'utf-8',chr(146)),$perehod);//π
	$perehod=str_replace("\u{03C1}",iconv('windows-1251', 'utf-8',chr(147)),$perehod);//ρ
	$perehod=str_replace("\u{03C2}",iconv('windows-1251', 'utf-8',chr(148)),$perehod);//ς
	$perehod=str_replace("\u{03C3}",iconv('windows-1251', 'utf-8',chr(150)),$perehod);//σ
	$perehod=str_replace("\u{03C4}",iconv('windows-1251', 'utf-8',chr(151)),$perehod);//τ
	$perehod=str_replace("\u{03C5}",iconv('windows-1251', 'utf-8',chr(153)),$perehod);//υ
	$perehod=str_replace("\u{03C6}",iconv('windows-1251', 'utf-8',chr(154)),$perehod);//φ
	$perehod=str_replace("\u{03C7}",iconv('windows-1251', 'utf-8',chr(155)),$perehod);//χ
	$perehod=str_replace("\u{03C8}",iconv('windows-1251', 'utf-8',chr(156)),$perehod);//ψ
	$perehod=str_replace("\u{03C9}",iconv('windows-1251', 'utf-8',chr(157)),$perehod);//ω
	$perehod=str_replace("\u{03D1}",iconv('windows-1251', 'utf-8',chr(158)),$perehod);//ϑ
	$perehod=str_replace("\u{03D2}",iconv('windows-1251', 'utf-8',chr(159)),$perehod);//ϒ
	$pattern = '~\(\([^\(\)]+\)\)~';//паттерн в двойных скобках
	//$pattern = '~\(\(\w+\)\)~';//паттерн в двойных скобках
	preg_match_all($pattern, $perehod, $arr);//проверка текста перехода на паттерн
	if ($arr[0]!=null){ //если есть вхождение
		foreach ($arr[0] as $key => $value) {//перебор массива вхождений
			$xflag=null;
			$dop1=array('ПР','ПЛ','КР','ЦИ','ПС','ПА','ПЕ','НА','СО','СИ','ДП','ПО','БИ','БП','ФП','ФО','ПАПЛ','ПЕПЛ','НАПЛ');
			$dop2=array(chr(161),chr(162),chr(163),chr(165),chr(166),chr(178),chr(179),chr(180),chr(181),chr(182),chr(129),chr(183),chr(188),chr(189),chr(190),chr(191),chr(178).chr(162),chr(179).chr(162),chr(180).chr(162));
			//ПРямолинейность, ПЛоскостность, КРуглость, ЦИлиндричность, профиль Продольного Сечения, 
			//ПАраллельность, ПЕрпендикулярность, НАклон, СОосность, СИмметричность,
			//Допуск Позиционный, Пересечение Осей, допуск БИения, допуск Биения Полного,
			//Форма Профиля, ФОрма поверхности
			//$pattern1 = '~\(\(([АБДЕИКЛНОПРСФ]{2,4}+)\|+([сфера ¤|сфера R|¤|R|T|T/2]?+[\,\.\/\x\Ї\¤\©\®0-9]+)\|?+([А-ЯA-Z\®]+)?\|?+([А-ЯA-Z\®]+)?\|?+([А-ЯA-Z\®]+)?\)\)~';//паттерн на допуск формы и положения
			$pattern1 = '~\(\(([АБДЕИКЛНОПРСФЦ]*+)\|+([сфера ¤|сфера R|¤|R|T|T/2]?+[\,\.\/\x\Ї\¤\©\®0-9]*.+[\,\.\/\x\Ї\¤\©\®0-9]?+)\|?+([А-ЯA-Z\®]+)?\|?+([А-ЯA-Z\®]+)?\|?+([А-ЯA-Z\®]+)?\)\)~';//паттерн на допуск формы и положения
			//$pattern2 = '~\(\(([-+]?[0-9]*[.,][0-9]+)\/+([-+]?[0-9]*[.,][0-9]+)\)\)~';//паттерн на допуск ((+0,1/-0,2))
			$pattern2 = '~\(\(([\+\-\.\,0-9]+)\/+([\+\-\.\,0-9]+)\)\)~';//паттерн на допуск ((+0,1/-0,2))
			$pattern3 = '~\(\(([Ra|Rz|Rmax]+[\ \,\.0-9]+)\)\)~';//паттерн на шероховатость в двойных скобках
			$pattern4 = '~\(\(([0-9]+)\)\)~';//паттерн на числа в двойных скобках
			preg_match($pattern1, $value, $arr1);
			if (isset($arr1[0])) $xflag="SLT";
			preg_match($pattern2, $value, $arr2);
			if (isset($arr2[0])) $xflag="IT";
			preg_match($pattern3, $value, $arr3);
			if (isset($arr3[0])) $xflag="Ra";
			preg_match($pattern4, $value, $arr4);
			if (isset($arr4[0])) $xflag="Num";
			switch ($xflag){
				case "SLT":
					/*foreach ($arr1 as $key => $value) {
						$value=str_replace('<M>',iconv('windows-1251', 'utf-8',chr(129)),$value);	
					}*/
					foreach ($dop1 as $key => $value2) {
						if ($value2===$arr1[1]) $arr1[1]=iconv('windows-1251', 'utf-8',$dop2[$key]);
					}
					if (isset($arr1[3])) $sk1="|"; else {$sk1="";$arr1[3]="";}
					if (isset($arr1[4])) $sk2="|"; else {$sk2="";$arr1[4]="";}
					if (isset($arr1[5])) $sk3="|"; else {$sk3="";$arr1[5]="";}
					$sx=" ".$arr1[1]."|".$arr1[2].$sk1.$arr1[3].$sk2.$arr1[4].$sk3.$arr1[5]." ";
					$sx=str_replace(['[M]','[m]'],iconv('windows-1251', 'utf-8',chr(174)),$sx);
					$sx=str_replace(['[P]','[p]'],iconv('windows-1251', 'utf-8',chr(169)),$sx);	
					//$sx=iconv('windows-1251', 'utf-8',$sx);
					//echo"***SX ";var_dump($arr1);echo" SX***"."<br>";
					break;
				case "IT":
					$arr0=array(strlen($arr2[1]),strlen($arr2[2]));
					$sx=str_repeat(" ", max($arr0)*1.5);
					break;
				case "Ra":
					$sx="    ".$arr3[1];
					break;
				case "Num":
					switch (strlen($arr4[1])){
						case 1:
							$sx="  ".$arr4[1]."   ";
							break;
						case 2:
							$sx=" ".$arr4[1]."  ";
							break;
						default:
							$sx="".$arr4[1]."  ";
					}
					break;
			}
			$x1=strpos($perehod,$value);//позиция начала вхождения
			$x2=strlen($value);//длина вхождения
			$perehod=substr_replace($perehod,$sx,$x1,$x2);//замена круглых скобок в тексте перехода на пробелы
			$x2=strlen($sx);//длина вхождения
			$x3=substr($perehod,0,$x1);//текст строки до вхождения
			$x4=substr($perehod,0,$x1+$x2);//текст строки включая вхождение
			
			$x5=$this->GetStringWidth(iconv('utf-8', 'windows-1251', $x3));//расчет длины текста в мм
			$x6=$this->GetStringWidth(iconv('utf-8', 'windows-1251', $x4));//расчет длины текста в мм		
			switch ($xflag){
				case "SLT":
					//echo"***SLT ";var_dump($arr1);echo" SLT***"."<br>";
					$x7=$x5+20.3;
					$this->Rect($x7,$y+1.4,$x6-$x5-1.2,5.2);
					break;
				case "IT":
					//echo"***IT ";var_dump($arr2);echo" IT***"."<br>";
					$arr2=str_replace(',','.',$arr2);
					$this->SetFont('gost_a','',9);
					if ($arr2[1]==0) $arr2[1]="";
					$x7=$x5+18.7;
					$this->setxy($x7,$y+1);
					$this->cell(10,3.5,$arr2[1],0,0,'L');//печать верхнего допуска
					if ($arr2[2]==0) $arr2[2]="";
					$this->setxy($x7-0.5,$y+3.8);
					$this->cell(10,3.5,$arr2[2],0,0,'L');//печать нижнего допуска
					$this->SetFont('gost_a','',12);
					break;
				case "Ra":
					//echo"***Ra ";var_dump($arr3);echo" Ra***";
					$x7=$x5+22;//расчет центра по оси х
					$this->line($x7,$y+5.5,$x7+2.7,$y+1.5);//рисование значка шероховатости
					$this->line($x7,$y+5.5,$x7-1.5,$y+3.2);
					$this->line($x7+2.7,$y+1.5,$x6+20,$y+1.5);
					break;
				case "Num":
					//echo"***Num ";var_dump($arr4);echo" Num***";;
					$x7=($x5+$x6)/2+19.3;//расчет центра окружности по оси х
					$this->Circle($x7,$y+8.5/2,3.2);//рисование окружности
					break;
			}
		}
	}
	//var_dump($arr);
	return $perehod;
}

function Circle($x, $y, $r, $style='D'){
    $this->Ellipse($x,$y,$r,$r,$style);
}

function Ellipse($x, $y, $rx, $ry, $style='D'){
    if($style=='F')
        $op='f';
    elseif($style=='FD' || $style=='DF')
        $op='B';
    else
        $op='S';
    $lx=4/3*(M_SQRT2-1)*$rx;
    $ly=4/3*(M_SQRT2-1)*$ry;
    $k=$this->k;
    $h=$this->h;
    $this->_out(sprintf('%.2F %.2F m %.2F %.2F %.2F %.2F %.2F %.2F c',
        ($x+$rx)*$k,($h-$y)*$k,
        ($x+$rx)*$k,($h-($y-$ly))*$k,
        ($x+$lx)*$k,($h-($y-$ry))*$k,
        $x*$k,($h-($y-$ry))*$k));
    $this->_out(sprintf('%.2F %.2F %.2F %.2F %.2F %.2F c',
        ($x-$lx)*$k,($h-($y-$ry))*$k,
        ($x-$rx)*$k,($h-($y-$ly))*$k,
        ($x-$rx)*$k,($h-$y)*$k));
    $this->_out(sprintf('%.2F %.2F %.2F %.2F %.2F %.2F c',
        ($x-$rx)*$k,($h-($y+$ly))*$k,
        ($x-$lx)*$k,($h-($y+$ry))*$k,
        $x*$k,($h-($y+$ry))*$k));
    $this->_out(sprintf('%.2F %.2F %.2F %.2F %.2F %.2F c %s',
        ($x+$lx)*$k,($h-($y+$ry))*$k,
        ($x+$rx)*$k,($h-($y+$ly))*$k,
        ($x+$rx)*$k,($h-$y)*$k,
        $op));
}
//============================================================================================================
//=== Титульный лист ===
//============================================================================================================
function PrintTL($tp, $ds){
$today=Date("d.m.y",strtotime($tp['tpdate']));
//$today->format("d.m.y");
//ГОСТ 3.1105-82011 ТЛ Форма 2 
//$this->AddFont('gost_a','','Arial-ItalicMT.php');//GOSTmi
$this->SetFont('gost_a','',12);
$this->SetAutoPageBreak(true,0);
$this->SetMargins(5.5,0,5.5);
$this->SetTextColor( 0, 0, 0);
$this->AddPage('L','A4');
// Рамка B6Ф1 ГОСТ 3.1103-82 блок вида и назначения документа
$this->rect(5.5,201.5,286,8.5);
$this->rect(5.5,201.5,23.5,8.5);
	$this->SetFont('gost_a','',15);	
	$this->SetXY(5.5,201.5);
	$this->Cell(23.5,8.5,'ТЛ',0,0,'C');
	$this->Cell(246.9,8.5,'Титульный лист',0,0,'L');
	//$this->Cell(15.6,8.5,$this->PageNo(),0,0,'C');
//$this->rect(297-5.5-15.6,201.5,15.6,8.5);
//Данные
$this->SetFont('gost_a','',12);
$this->rect(5.5,31.5,286,170);

// Рамка Б1Ф1 ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$this->rect(101.7,31.5,189.8,21.25);
$this->line(101.7,44.25,291.5,44.25);
$this->line(143.3,31.5,143.3,44.25);
$this->line(203.1,31.5,203.1,44.25);
$this->line(244.7,31.5,244.7,44.25);
$this->line(114.7,44.5,114.7,46.5);
$this->line(281.1,44.25,281.1,52.75);
$this->line(270.7,44.25,270.7,52.75);
$this->line(260.3,44.25,260.3,52.75);
$this->SetLineWidth(0.8);
$this->rect(143.3,31.5,148.2,12.75);
$this->SetLineWidth(0.2);
$this->SetXY(250,2);
$this->Cell(40,4.25,'ГОСТ 3.1105-2011 Форма 2',0,1,'R');
//$this->write(0,'ГОСТ 3.1105-2011 Форма 2');
$this->line(148.5,3,148.5,11);
// Рамка Б5Ф1 ГОСТ 3.1103-2011 блок вспомогательной информации
$this->rect(5.5,23,286,8.5);
$this->line(275.9,23,275.9,31.5);
$this->line(260.3,23,260.3,31.5);
$this->line(213.5,23,213.5,31.5);
$this->line(153.7,23,153.7,26);
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$this->rect(5.5,10.25,75.4,12.75);
$this->line(5.5,14.5,80.9,14.5);
$this->line(5.5,18.75,80.9,18.75);
$this->line(23.7,10.25,23.7,14.5);
$this->line(44.5,10.25,44.5,14.5);
$this->line(65.3,10.25,65.3,14.5);
$this->line(23.7,18.75,23.7,23);
$this->line(44.5,18.75,44.5,23);
$this->line(65.3,18.75,65.3,23);
$this->setxy(5.5,10.25);
$this->SetFont('gost_a','',12);
$this->Cell(18.2,4.25,'Дубл.',1,2,'L');
$this->Cell(18.2,4.25,'Взам.',1,2,'L');
$this->Cell(18.2,4.25,'Подп.',1,2,'L');
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(210.9,6,80.6,17);
$this->line(210.9,10.25,291.5,10.25);
$this->line(210.9,14.5,291.5,14.5);
$this->line(210.9,18.75,291.5,18.75);
$this->line(221.3,6,221.3,23);
$this->line(231.6,6,231.6,23);
$this->line(255.1,6,255.1,23);
$this->line(275.9,6,275.9,23);
//_________________________________________________________
//вывод текста
$this->SetFont('gost_a','',14);
$this->setxy(244.7,31.5);
$this->Cell(46.8,12.75,$tp['doc'],0,1,'C');//обозначение документа по ГОСТ 3.1201
$this->setxy(101.7,31.5);
if($tp['drawing']!=null){
	$this->Image('./uploads/'.$tp['drawing'],101.7+0.5,31.5+0.5,41.6-1,12.75-1);
}
else{
	$this->Cell(41.6,12.75,$tp['flabel'],0,0,'C');//Краткое наименование или условное обозначение (код) организации (предприятия) - разработчика документа (документов)
}
$this->setxy(143.3,31.5);
$this->Cell(59.8,12.75,$ds['designation'],0,1,'C');//Обозначение изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->AliasNbPages();//Количество листов
$this->setxy(260.3,23);
$this->Cell(15.6,8.5,'  {nb}',0,0,'C');//Количество листов
//$this->setxy(275.9,23);
$this->Cell(15.6,8.5,$this->PageNo(),0,1,'C');//Номер листа
$this->setxy(153.7,23);
$this->Cell(59.8,8.5,$tp['product'],0,1,'C');//Обозначение изделия или классификационного кода
$this->setxy(114.7,44.25);
$this->Cell(145.6,8.5,$ds['name'],0,0,'C');//Наименование изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->SetFont('gost_a','',12);
$this->Cell(10.4,8.5,$tp['letter1'],0,0,'C');//Стадия проектирования 1
$this->Cell(10.4,8.5,$tp['letter2'],0,0,'C');//Стадия проектирования 2
$this->Cell(10.4,8.5,$tp['letter3'],0,0,'C');//Стадия проектирования 3
$this->SetFont('gost_a','',14);
$this->setxy(5.5,52.75);
$this->Cell(286,17,$tp['boss'],0,0,'C');//наименование вышестоящей организации
$this->setxy(20,80);
$this->Cell(50,8.5,'СОГЛАСОВАНО',0,0,'C');
$this->setxy(226,80);
$this->Cell(50,8.5,'УТВЕРЖДАЮ',0,0,'C');
$this->SetFont('gost_a','',14);
$this->setxy(5.5,110);
$this->MultiCell(0,8,'КОМПЛЕКТ ТЕХНОЛОГИЧЕСКОЙ ДОКУМЕНТАЦИИ
на технологический процесс механической обработки',0,'C');

}
//============================================================================================================
//=== Маршрутная карта ===
//============================================================================================================
//----------------------------------------------------
function PrintMK1p($tp, $ds, $pgs){
$today=Date("d.m.y",strtotime($tp['tpdate']));
//ГОСТ 3.1118-86 МК Форма 1 (Заглавный лист)
//$this->AddFont('gost_a','','GOSTmi.php');
$this->SetFont('gost_a','',12);
$this->SetAutoPageBreak(true,0);
$this->SetMargins(5.5,0,5.5);
$this->SetTextColor( 0, 0, 0);
$this->AddPage('L','A4');
// Рамка B6Ф1 ГОСТ 3.1103-82 блок вида и назначения документа
$this->rect(5.5,201.5,286,8.5);
$this->rect(5.5,201.5,23.5,8.5);
	$this->SetFont('gost_a','',15);	
	$this->SetXY(5.5,201.5);
	$this->Cell(23.5,8.5,'МK',0,0,'C');
	$this->Cell(246.9,8.5,'Маршрутная карта',0,0,'L');
	$this->Cell(15.6,8.5,$this->PageNo(),0,0,'C');
$this->rect(297-5.5-15.6,201.5,15.6,8.5);
//Данные
$this->SetFont('gost_a','',12);
$this->rect(5.5,82.5,286,119);
for ($x=0; $x++<14;){ 
	$this->line(5.5,$x*8.5+82.5,286+5.5,$x*8.5+82.5);
	$this->line(5.5+13,$x*8.5+82.5-8.5,5.5+13,82.5+$x*8.5);
	$this->setxy(5.5+5,$x*8.5+82.5-8.5);
	$this->cell(13/2,8.5,sprintf('%02d',$x+2),0,1,'L');
}
$this->setXY(5.5,78.25);
$this->cell(13,4.25,'Б',1,0,'C');
$this->cell(119.6,4.25,'Код, наименование оборудования',1,0,'C');
$this->cell(10.4,4.25,'СМ',1,0,'C');
$this->cell(18.2,4.25,'Проф.',1,0,'C');
$this->cell(10.4,4.25,'Р',1,0,'C');
$this->cell(13,4.25,'УТ',1,0,'C');
$this->cell(10.4,4.25,'КР',1,0,'C');
$this->cell(13,4.25,'КОИД',1,0,'C');
$this->cell(13,4.25,'ЕН',1,0,'C');
$this->cell(13,4.25,'ОП',1,0,'C');
$this->cell(13,4.25,'Кшт.',1,0,'C');
$this->cell(18.2,4.25,'Тпз',1,0,'C');
$this->cell(20.8,4.25,'Тшт.',1,0,'C');
$this->setXY(5.5,74);
$this->cell(13,4.25,'А',1,0,'C');
$this->cell(10.4,4.25,'Цех',1,0,'C');
$this->cell(10.4,4.25,'Уч.',1,0,'C');
$this->cell(10.4,4.25,'РМ',1,0,'C');
$this->cell(13,4.25,'Опер.',1,0,'C');
$this->cell(75.4,4.25,'Код, наименование операции',1,0,'C');
$this->cell(153.4,4.25,'Обозначение документа',1,0,'C');
$this->setXY(5.5,52.75);
$this->cell(13,8.5,'М 01',1,0,'C');
$this->rect(18.5,52.75,231.4,8.5);
$this->rect(249.9,52.75,41.6,21.25);
$this->rect(5.5,61.25,13,12.75);
$this->setXY(5.5,65.5);
$this->cell(13,8.5,'М 02',0,0,'C');
$this->setXY(18.5,61.25);
$this->cell(33.8,4.25,'Код',1,0,'C');
$this->cell(10.4,4.25,'ЕВ',1,0,'C');
$this->cell(18.2,4.25,'МД',1,0,'C');
$this->cell(15.6,4.25,'ЕН',1,0,'C');
$this->cell(18.2,4.25,'Н.расх.',1,0,'C');
$this->cell(13,4.25,'КИМ',1,0,'C');
$this->cell(33.8,4.25,'Код заготовки',1,0,'C');
$this->cell(54.6,4.25,'Профиль и размеры',1,0,'C');
$this->cell(15.6,4.25,'КД',1,0,'C');
$this->cell(18.2,4.25,'МЗ',1,0,'C');
$this->line(52.3,65.5,52.3,74);
$this->line(62.7,65.5,62.7,74);
$this->line(80.9,65.5,80.9,74);
$this->line(96.5,65.5,96.5,74);
$this->line(114.7,65.5,114.7,74);
$this->line(127.7,65.5,127.7,74);
$this->line(161.5,65.5,161.5,74);
$this->line(216.1,65.5,216.1,74);
$this->line(231.7,65.5,231.7,74);
$this->SetLineWidth(0.8);
$this->rect(18.5,65.5,96.2,8.5);
$this->rect(127.7,65.5,33.8,8.5);
$this->rect(216.1,65.5,33.8,8.5);
$this->rect(18.5,74,273,8.5);
$this->SetLineWidth(0.2);
// Рамка Б5Ф1 ГОСТ 3.1103-2011 блок вспомогательной информации
$this->rect(5.5,23,286,8.5);
$this->line(275.9,23,275.9,31.5);
$this->line(260.3,23,260.3,31.5);
$this->line(213.5,23,213.5,31.5);
$this->line(153.7,23,153.7,26);
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$this->rect(5.5,10.25,75.4,12.75);
$this->line(5.5,14.5,80.9,14.5);
$this->line(5.5,18.75,80.9,18.75);
$this->line(23.7,10.25,23.7,14.5);
$this->line(44.5,10.25,44.5,14.5);
$this->line(65.3,10.25,65.3,14.5);
$this->line(23.7,18.75,23.7,23);
$this->line(44.5,18.75,44.5,23);
$this->line(65.3,18.75,65.3,23);
$this->setxy(5.5,10.25);
$this->SetFont('gost_a','',12);
$this->Cell(18.2,4.25,'Дубл.',1,2,'L');
$this->Cell(18.2,4.25,'Взам.',1,2,'L');
$this->Cell(18.2,4.25,'Подп.',1,2,'L');
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(210.9,6,80.6,17);
$this->line(210.9,10.25,291.5,10.25);
$this->line(210.9,14.5,291.5,14.5);
$this->line(210.9,18.75,291.5,18.75);
$this->line(221.3,6,221.3,23);
$this->line(231.6,6,231.6,23);
$this->line(255.1,6,255.1,23);
$this->line(275.9,6,275.9,23);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(130.3,14.5,80.6,8.5);
$this->line(130.3,18.75,210.9,18.75);
$this->line(140.7,14.5,140.7,23);
$this->line(151.1,14.5,151.1,23);
$this->line(174.5,14.5,174.5,23);
$this->line(195.3,14.5,195.3,23);
// Рамка Б1Ф1 ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$this->rect(101.7,31.5,189.8,21.25);
$this->line(101.7,44.25,291.5,44.25);
$this->line(143.3,31.5,143.3,44.25);
$this->line(203.1,31.5,203.1,44.25);
$this->line(244.7,31.5,244.7,44.25);
$this->line(114.7,44.5,114.7,46.5);
$this->line(281.1,44.25,281.1,52.75);
$this->line(270.7,44.25,270.7,52.75);
$this->line(260.3,44.25,260.3,52.75);
$this->SetLineWidth(0.8);
$this->rect(143.3,31.5,148.2,12.75);
$this->SetLineWidth(0.2);
// Рамка Б2Ф1 ГОСТ 3.1103-2011 Исполнители
$this->rect(5.5,31.5,96.2,21.25);
$this->line(28.9,31.5,28.9,52.75);
$this->line(65.3,31.5,65.3,52.75);
$this->line(86.1,31.5,86.1,52.75);
$this->line(5.5,35.75,101.2,35.75);
$this->line(5.5,40,101.7,40);
$this->line(5.5,44.25,101.7,44.25);
$this->line(5.5,48.5,101.7,48.5);
//Задаем шрифт
$this->setxy(5.5,31.5);
$this->SetFont('gost_a','',12);
//В ячейке 23.4х4.25 мм с разрывом строк выравнивание текста задаем по левой стороне
$this->Cell(23.4,4.25,'Разраб.',0,2,'L');
$this->Cell(23.4,4.25,'Проверил',0,2,'L');
$this->Cell(23.4,4.25,'Утвердил',0,2,'L');
$this->Cell(23.4,4.25,'',0,2,'L');
//$this->SetXY(5.5,48.5);
$this->Cell(23.4,4.25,'Н.контр.');
$this->SetXY(86.1,31.5);
$this->Cell(15.6,4.25,$today,0,1,'C');
$this->SetXY(250,2);
$this->Cell(40,4.25,'ГОСТ 3.1118-82 Форма 1',0,1,'R');
//$this->SetXY(210,4);
//$this->write(0,'ГОСТ 3.1118-82 Форма 1');
$this->line(148.5,3,148.5,11);
//_________________________________________________________
//вывод текста
$this->SetFont('gost_a','',12);
$this->setxy(28.9,31.5);
$this->Cell(36.4,4.25,$tp['performer'],0,2,'L');//Фамилия исполнителя
$this->Cell(36.4,4.25,$tp['cheсking'],0,2,'L');//Проверил
$this->Cell(36.4,4.25,$tp['approving'],0,2,'L');//Утвердил
$this->Cell(23.4,4.25,'',0,2,'L');
$this->Cell(36.4,4.25,$tp['normcontrol'],0,2,'L');//Н.контроль
$this->SetFont('gost_a','',14);
$this->setxy(244.7,31.5);
$this->Cell(46.8,12.75,$tp['doc'],0,1,'C');//обозначение документа по ГОСТ 3.1201
$this->setxy(101.7,31.5);
if($tp['drawing']!=null){
	$this->Image('./uploads/'.$tp['drawing'],101.7+0.5,31.5+0.5,41.6-1,12.75-1);
}
else{
	$this->Cell(41.6,12.75,$tp['flabel'],0,0,'C');//Краткое наименование или условное обозначение (код) организации (предприятия) - разработчика документа (документов)
}
$this->setxy(143.3,31.5);
$this->Cell(59.8,12.75,$ds['designation'],0,1,'C');//Обозначение изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->setxy(260.3,23);
$this->Cell(15.6,8.5,$pgs,0,0,'C');//Количество листов
//$this->setxy(275.9,23);
$this->Cell(15.6,8.5,'1',0,1,'C');//Номер листа
$this->setxy(153.7,23);
$this->Cell(59.8,8.5,$tp['product'],0,1,'C');//Обозначение изделия или классификационного кода
$this->setxy(114.7,44.25);
$this->Cell(145.6,8.5,$ds['name'],0,0,'C');//Наименование изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->SetFont('gost_a','',12);
$this->Cell(10.4,8.5,$tp['letter1'],0,0,'C');//Стадия проектирования 1
$this->Cell(10.4,8.5,$tp['letter2'],0,0,'C');//Стадия проектирования 2
$this->Cell(10.4,8.5,$tp['letter3'],0,0,'C');//Стадия проектирования 3
$this->setxy(18.5,52.75);
$this->Cell(231.4,8.5,$tp['m01'],0,0,'L');//Наименование, сортамент, размер и марка материала, ГОСТ, ТУ
$this->setxy(18.5,65.5);
$this->Cell(33.8,8.5,$tp['matcode'],0,0,'C');//Код материала по классификатору
$this->Cell(10.4,8.5,$tp['unitcode'],0,0,'C');//Код единицы величины (массы, длины, площади и т.п.) детали, заготовки, материала
if ($tp['mass']>0)$this->cell(18.2,8.5,number_format($tp['mass'],2,',',''),0,0,'C');//Масса детали по конструкторскому документу
$this->setxy(80.9,65.5);
$this->cell(15.6,8.5,$tp['standartunit'],0,0,'C');//Единица нормирования, на которую установлена норма расхода материала или времени
if ($tp['matrate']>0) $this->cell(18.2,8.5,number_format($tp['matrate'],2,',',''),0,0,'C');//Норма расхода материала
$this->setxy(114.7,65.5);
if ($tp['kim']>0)$this->cell(13,8.5,number_format($tp['kim'],2,',',''),0,0,'C');//Коэффициент использования материала
$this->setxy(127.7,65.5);
$this->cell(33.8,8.5,$tp['blankcode'],0,0,'C');//Код заготовки по классификатору
$dims=str_replace('DIAM','¤',$tp['dimensions']);
$this->cell(54.6,8.5,$dims,0,0,'C');//Профиль и размеры заготовки
$this->cell(15.6,8.5,$tp['numdet'],0,0,'C');//Количество деталей, изготовляемых из одной заготовки
if ($tp['blankmass']>0)$this->cell(18.2,8.5,number_format($tp['blankmass'],2,',',''),0,0,'C');//Масса заготовки
}
function PrintMK2p($tp, $ds, $pg){
//_________________________________________________________
//второй лист МК форма 1б ГОСТ 3.1118-82
//$this->AddFont('gost_a','','GOSTmi.php');
$this->SetFont('gost_a','',12);
//$this->SetAutoPageBreak(true,0);
//$this->SetMargins(5.5,0,5.5);
//$this->SetTextColor( 0, 0, 0);
$this->AddPage('L','A4');

// Рамка B6Ф1 ГОСТ 3.1103-2011 блок вида и назначения документа
$this->rect(5.5,201.5,286,8.5);
$this->rect(5.5,201.5,23.5,8.5);
	$this->SetFont('gost_a','',15);	
	$this->SetXY(5.5,201.5);
	$this->Cell(23.5,8.5,'МК',0,0,'C');
	$this->Cell(246.9,8.5,'Маршрутная карта',0,0,'L');
	$this->Cell(15.6,8.5,$this->PageNo(),0,0,'C');
$this->rect(297-5.5-15.6,201.5,15.6,8.5);
//Данные
//$this->AddFont('gost_a','','GOSTmi.php');
$this->SetFont('gost_a','',12);
$this->rect(5.5,57,286,144.5);
for ($x=0; $x++<17;){ 
	$this->line(5.5,$x*8.5+57,286+5.5,$x*8.5+57);
	$this->line(5.5+13,$x*8.5+57-8.5,5.5+13,57+$x*8.5);
	$this->setxy(5.5+5,$x*8.5+57-8.5);
	$this->cell(13/2,8.5,sprintf('%02d',$x),0,1,'L');
}
$this->setXY(5.5,44.25);
$this->cell(13,4.25,'А',1,0,'C');
$this->cell(10.4,4.25,'Цех',1,0,'C');
$this->cell(10.4,4.25,'Уч.',1,0,'C');
$this->cell(10.4,4.25,'РМ',1,0,'C');
$this->cell(13,4.25,'Опер.',1,0,'C');
$this->cell(75.4,4.25,'Код, наименование операции',1,0,'C');
$this->cell(153.4,4.25,'Обозначение документа',1,0,'C');
$this->setXY(5.5,48.5);
$this->cell(13,4.25,'Б',1,0,'C');
$this->cell(119.6,4.25,'Код, наименование оборудования',1,0,'C');
$this->cell(10.4,4.25,'СМ',1,0,'C');
$this->cell(18.2,4.25,'Проф.',1,0,'C');
$this->cell(10.4,4.25,'Р',1,0,'C');
$this->cell(13,4.25,'УТ',1,0,'C');
$this->cell(10.4,4.25,'КР',1,0,'C');
$this->cell(13,4.25,'КОИД',1,0,'C');
$this->cell(13,4.25,'ЕН',1,0,'C');
$this->cell(13,4.25,'ОП',1,0,'C');
$this->cell(13,4.25,'Кшт.',1,0,'C');
$this->cell(18.2,4.25,'Тпз',1,0,'C');
$this->cell(20.8,4.25,'Тшт.',1,0,'C');
$this->setXY(5.5,52.75);
$this->cell(13,4.25,'К/М',1,0,'C');
$this->cell(119.6,4.25,'Наименование детали, сб.единицы или материала',1,0,'C');
$this->cell(75.4,4.25,'Обозначение, код',1,0,'C');
$this->cell(13,4.25,'ОПП',1,0,'C');
$this->cell(13,4.25,'ЕВ',1,0,'C');
$this->cell(13,4.25,'ЕН',1,0,'C');
$this->cell(18.2,4.25,'КИ',1,0,'C');
$this->cell(20.8,4.25,'Н.расх.',1,0,'C');
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$this->rect(5.5,10.25,75.4,12.75);
$this->line(5.5,14.5,80.9,14.5);
$this->line(5.5,18.75,80.9,18.75);
$this->line(23.7,10.25,23.7,14.5);
$this->line(44.5,10.25,44.5,14.5);
$this->line(65.3,10.25,65.3,14.5);
$this->line(23.7,18.75,23.7,23);
$this->line(44.5,18.75,44.5,23);
$this->line(65.3,18.75,65.3,23);
$this->setxy(5.5,10.25);
$this->SetFont('gost_a','',12);
$this->Cell(18.2,4.25,'Дубл.',1,2,'L');
$this->Cell(18.2,4.25,'Взам.',1,2,'L');
$this->Cell(18.2,4.25,'Подп.',1,2,'L');
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(210.9,6,80.6,17);
$this->line(210.9,10.25,291.5,10.25);
$this->line(210.9,14.5,291.5,14.5);
$this->line(210.9,18.75,291.5,18.75);
$this->line(221.3,6,221.3,23);
$this->line(231.6,6,231.6,23);
$this->line(255.1,6,255.1,23);
$this->line(275.9,6,275.9,23);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(130.3,14.5,80.6,8.5);
$this->line(130.3,18.75,210.9,18.75);
$this->line(140.7,14.5,140.7,23);
$this->line(151.1,14.5,151.1,23);
$this->line(174.5,14.5,174.5,23);
$this->line(195.3,14.5,195.3,23);
// Рамка Б1Ф1а ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$this->rect(184.9,31.5,106.6,12.75);
$this->line(244.7,31.5,244.7,44.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(104.3,31.5,80.6,12.75);
$this->line(104.3,35.75,184.9,35.75);
$this->line(104.3,40,184.9,40);
$this->line(169.3,31.5,169.3,44.25);
$this->line(148.5,31.5,148.5,44.25);
$this->line(125.1,31.5,125.1,44.25);
$this->line(114.7,31.5,114.7,44.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(23.7,31.5,80.6,12.75);
$this->line(23.7,35.75,104.3,35.75);
$this->line(23.7,40,104.3,40);
$this->line(88.7,31.5,88.7,44.25);
$this->line(67.9,31.5,67.9,44.25);
$this->line(44.5,31.5,44.5,44.25);
$this->line(34.1,31.5,34.1,44.25);
$this->rect(5.5,31.5,18.2,12.75);
// Рамка Б5Ф1а ГОСТ 3.1103-2011 блок вспомогательной информации
$this->rect(5.5,23,286,8.5);
$this->line(275.9,23,275.9,31.5);
$this->line(229.1,23,229.1,31.5);
$this->line(169.3,23,169.3,26);
$this->SetLineWidth(0.8);
$this->line(5.5,44.25,291.5,44.25);
$this->line(291.5,44.25,291.5,57);
$this->line(291.5,57,138.1,57);
$this->line(138.1,57,138.1,52.75);
$this->line(138.1,52.75,5.5,52.75);
$this->line(5.5,44.25,5.5,52.75);
$this->SetLineWidth(0.2);
$this->SetXY(250,2);
$this->Cell(40,4.25,'ГОСТ 3.1118-82 Форма 1б',0,1,'R');
//$this->SetXY(210,4);
//$this->write(0,'ГОСТ 3.1118-82 Форма 1б');
$this->line(148.5,3,148.5,11);
//_________________________________________________________
//вывод текста
$this->SetFont('gost_a','',14);
$this->setxy(184.9,31.5);
$this->Cell(59.8,12.75,$ds['designation'],0,0,'C');//Обозначение изделия (детали, сборочной единицы) по основному конструкторскому документу
//$this->setxy(244.7,31.5);
$this->Cell(46.8,12.75,$tp['doc'],0,0,'C');//обозначение документа по ГОСТ 3.1201
$this->setxy(153.7+15.6,23);
$this->Cell(59.8,8.5,$tp['product'],0,1,'C');//Обозначение изделия или классификационного кода
$this->setxy(275.9,23);
$this->Cell(15.6,8.5,$pg,0,1,'C');//Номер листа
}
function PrintMKstr($data,$y){
//$this->AddFont('gost_a','','GOSTmi.php');
$this->SetFont('gost_a','',12);
$this->setxy(5.5,$y);//А
$this->cell(13/2,8.5,$data[1],0,0,'C');//символ А/Б/О/Т
$this->setxy(5.5+13,$y);
$this->cell(10.4,8.5,$data[3],0,0,'C');//цех
$this->cell(10.4,8.5,$data[4],0,0,'C');//участок
$this->cell(10.4,8.5,$data[5],0,0,'C');//рабочее место
if ($data[1]=='А') {$this->cell(13,8.5,sprintf('%03d',$data[6]),0,0,'C');}//номер операции
$this->cell(75.4,8.5,$data[7],0,0,'C');//код, наименование операции
$this->cell(153.4,8.5,$data[8],0,0,'C');//обозначение документа
$this->setxy(5.5+13,$y);//Б
$this->cell(119.6,8.5,$data[9],0,0,'C');//код, наименование оборудования
if ($data[10]==0) $data[10]='';
$this->cell(10.4,8.5,$data[10],0,0,'C');//степень механизации
$this->cell(18.2,8.5,$data[11],0,0,'C');//профессия
$this->cell(10.4,8.5,$data[12],0,0,'C');//разряд
$this->cell(13,8.5,$data[13],0,0,'C');//условия труда
if ($data[14]==0) $data[14]='';
$this->cell(10.4,8.5,$data[14],0,0,'C');//количество рабочих
if ($data[16]==0) $data[16]='';
$this->cell(13,8.5,$data[16],0,0,'C');//КОИД
$this->cell(13,8.5,$data[15],0,0,'C');//единица нормирования
if ($data[17]==0) $data[17]='';
$this->cell(13,8.5,$data[17],0,0,'C');//объем партии
if ($data[1]=='Б' && $data[18]!=0) {$this->cell(13,8.5,number_format($data[18],2,',',''),0,0,'C');}//Кшт
if ($data[1]=='Б' && $data[19]!=0) {$this->cell(18.2,8.5,number_format($data[19],2,',',''),0,0,'C');}//Тпз
if ($data[1]=='Б' && $data[20]!=0) {$this->cell(20.8,8.5,number_format($data[20],2,',',''),0,0,'C');}//Тшт
$perehod=str_replace(DIAM,'¤',$data[22]);//замена спецсимвола диаметра
$perehod=$this->Special($perehod,$y);
$this->setxy(5.5+13,$y);//О
$this->cell(286,8.5,$perehod,0,0,'L');//переход
$instr=str_replace(DIAM,'¤',$data[23]);
$this->setxy(5.5+13,$y);//Т
$this->cell(286,8.5,$instr,0,0,'L');//инструмент
}
function PrintOKstr($data,$y){
//$this->AddFont('gost_a','','GOSTmi.php');
$this->SetFont('gost_a','',12);
$this->setxy(5.5,$y);//О/Т/Р
$this->cell(13/2,8.5,$data[2],0,0,'C');//символ О/Т
$perehod=str_replace(DIAM,'¤',$data[4]);
$perehod=$this->Special($perehod,$y);
$this->setxy(5.5+13,$y);//О
$this->cell(286,8.5,$perehod,0,0,'L');//переход
$this->setxy(5.5+13,$y);//Т
$instr=str_replace(DIAM,'¤',$data[5]);
$this->cell(286,8.5,$instr,0,0,'L');//инструмент
$this->setxy(127.7,$y);//Р
if ($data[6]==0) $data[6]=NULL;
$this->cell(18.2,8.5,$data[6],0,0,'C');//позиция инструмента
$dorb=$data[7];
if ($dorb==0) $dorb=$data[8];
if ($dorb==0) $dorb=NULL;
$this->cell(28.6,8.5,$dorb,0,0,'C');//D или B
if ($data[9]==0) $data[9]=NULL;
$this->cell(23.4,8.5,$data[9],0,0,'C');//L
$ar=number_format($data[10],2,',','');
if ($ar=='0,00') $ar=NULL;
$this->cell(13,8.5,$ar,0,0,'C');//t
if ($data[11]==0) $data[11]=NULL;
$this->cell(15.6,8.5,$data[11],0,0,'C');//i
$s=number_format($data[12],2,',','');
if ($s=='0,00') $s=number_format($data[13],0,',','');
if ($s=='0') $s=NULL;
$this->cell(26,8.5,$s,0,0,'C');//s
if ($data[14]==0) $data[14]=NULL;
$this->cell(18.2,8.5,$data[14],0,0,'C');//n
if ($data[15]==0) $data[15]=NULL;
$this->cell(20.8,8.5,$data[15],0,0,'C');//V
$this->setxy(252.9,$y);//То, Тв
$DTo=number_format($data[16],2,',','');
if ($DTo=="0,00") $DTo=NULL;
$DTv=number_format($data[17],2,',','');
if ($DTv=="0,00") $DTv=NULL;
$this->SetFont('gost_a','',14);
$this->cell(18.2,8.5,$DTo,0,0,'C');//То
$this->cell(20.8,8.5,$DTv,0,0,'C');//Тв
$this->SetFont('gost_a','',12);
}
//============================================================================================================
//=== Операционная карта ===
//============================================================================================================
function PrintOK1p($tp, $ds, $pgs, $op){
$today=Date("d.m.y",strtotime($tp['tpdate']));
//ГОСТ 3.1404-86 ОК Форма 3 (Заглавный лист)
//$this->AddFont('gost_a','','GOSTmi.php');
$this->SetFont('gost_a','',12);
$this->SetAutoPageBreak(true,0);
$this->SetMargins(5.5,0,5.5);
$this->SetTextColor( 0, 0, 0);
$this->AddPage('L','A4');
// Рамка B6Ф1 ГОСТ 3.1103-2011 блок вида и назначения документа
$this->rect(5.5,201.5,286,8.5);
$this->rect(5.5,201.5,23.5,8.5);
	$this->SetFont('gost_a','',15);	
	$this->SetXY(5.5,201.5);
	$this->Cell(23.5,8.5,'OK',0,0,'C');
	$this->Cell(246.9,8.5,'Oперационная карта',0,0,'L');
	$this->Cell(15.6,8.5,$this->PageNo(),0,0,'C');
$this->rect(297-5.5-15.6,201.5,15.6,8.5);
//$this->line(297-5.5-286,201.5,297-5.5-286,210);
// Рамка B3Ф1г ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(5.5,197.25,286,4.25);
$this->line(275.9,197.25,275.9,201.5);
$this->line(255.1,197.25,255.1,201.5);
$this->line(231.7,197.25,231.7,201.5);
$this->line(221.3,197.25,221.3,201.5);
$this->line(210.9,197.25,210.9,201.5);
$this->line(195.3,197.25,195.3,201.5);
$this->line(174.5,197.25,174.5,201.5);
$this->line(151.1,197.25,151.1,201.5);
$this->line(140.7,197.25,140.7,201.5);
$this->line(130.3,197.25,130.3,201.5);
$this->line(114.7,197.25,114.7,201.5);
$this->line(93.9,197.25,93.9,201.5);
$this->line(70.5,197.25,70.5,201.5);
$this->line(60.1,197.25,60.1,201.5);
$this->line(49.7,197.25,49.7,201.5);
//Данные
$this->SetFont('gost_a','',12);
$this->rect(5.5,86.75,286,110.5);
for ($x=0; $x++<13;){ 
	$this->line(5.5,$x*8.5+86.75,286+5.5,$x*8.5+86.75);
	$this->line(5.5+13,$x*8.5+86.75-8.5,5.5+13,86.75+$x*8.5);
	$this->setxy(5.5+5,$x*8.5+86.75-8.5);
	$this->cell(13/2,8.5,sprintf('%02d',$x),0,1,'L');
	//$this->setxy(5.5,$x*8.5+86.75-8.5);
	//$this->cell(13/2,8.5,sprintf('%02d',$x),0,1,'L');
}
$this->setXY(5.5,86.75-4.25);
$this->cell(13,4.25,'Р',1,0,'C');
$this->cell(109.2,4.25,' ',1,0,'C');
$this->cell(18.2,4.25,'ПИ',1,0,'C');
$this->cell(28.6,4.25,'D или B',1,0,'C');
$this->cell(23.4,4.25,'L',1,0,'C');
$this->cell(13,4.25,'t',1,0,'C');
$this->cell(15.6,4.25,'i',1,0,'C');
$this->cell(26,4.25,'s',1,0,'C');
$this->cell(18.2,4.25,'n',1,0,'C');
$this->cell(20.8,4.25,'v',1,0,'C');
$this->setXY(5.5,65.5);
$this->cell(78,4.25,'Оборудование, устройство ЧПУ',1,0,'C');
$this->cell(65,4.25,'Обозначение программы',1,0,'C');
$this->cell(18.2,4.25,'То',1,0,'C');
$this->cell(20.8,4.25,'Тв',1,0,'C');
$this->cell(18.2,4.25,'Тпз',1,0,'C');
$this->cell(20.8,4.25,'Тшт',1,0,'C');
$this->cell(65,4.25,'СОЖ',1,0,'C');
$this->setXY(5.5,52.75);
$this->cell(78,4.25,'Наименование операции',1,0,'C');
$this->cell(65,4.25,'Материал',1,0,'C');
$this->cell(28.6,4.25,'Твердость',1,0,'C');
$this->cell(10.4,4.25,'ЕВ',1,0,'C');
$this->cell(18.2,4.25,'МД',1,0,'C');
$this->cell(54.6,4.25,'Профиль и размеры',1,0,'C');
$this->cell(18.2,4.25,'МЗ',1,0,'C');
$this->cell(13,4.25,'КОИД',1,0,'C');
$this->rect(5.5,57,78,8.5);
$this->rect(83.5,57,65,8.5);
$this->rect(148.5,57,28.6,8.5);
$this->rect(177.1,57,10.4,8.5);
$this->rect(187.5,57,18.2,8.5);
$this->rect(205.7,57,54.6,8.5);
$this->rect(260.3,57,18.2,8.5);
$this->rect(278.5,57,13,8.5);
$this->rect(5.5,69.75,78,12.75);
$this->rect(83.5,69.75,65,12.75);
$this->rect(148.5,69.75,18.2,12.75);
$this->rect(166.7,69.75,20.8,12.75);
$this->rect(187.5,69.75,18.2,12.75);
$this->rect(205.7,69.75,20.8,12.75);
$this->rect(226.5,69.75,65,12.75);
$this->SetLineWidth(0.8);
$this->rect(148.5,69.75,78,12.75);
$this->SetLineWidth(0.2);
// Рамка Б5Ф1 ГОСТ 3.1103-2011 блок вспомогательной информации
$this->rect(5.5,23,286,8.5);
$this->line(275.9,23,275.9,31.5);
$this->line(260.3,23,260.3,31.5);
$this->line(213.5,23,213.5,31.5);
$this->line(153.7,23,153.7,26);
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$this->rect(5.5,10.25,75.4,12.75);
$this->line(5.5,14.5,80.9,14.5);
$this->line(5.5,18.75,80.9,18.75);
$this->line(23.7,10.25,23.7,14.5);
$this->line(44.5,10.25,44.5,14.5);
$this->line(65.3,10.25,65.3,14.5);
$this->line(23.7,18.75,23.7,23);
$this->line(44.5,18.75,44.5,23);
$this->line(65.3,18.75,65.3,23);
$this->setxy(5.5,10.25);
$this->SetFont('gost_a','',12);
$this->Cell(18.2,4.25,'Дубл.',1,2,'L');
$this->Cell(18.2,4.25,'Взам.',1,2,'L');
$this->Cell(18.2,4.25,'Подп.',1,2,'L');
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(210.9,6,80.6,17);
$this->line(210.9,10.25,291.5,10.25);
$this->line(210.9,14.5,291.5,14.5);
$this->line(210.9,18.75,291.5,18.75);
$this->line(221.3,6,221.3,23);
$this->line(231.6,6,231.6,23);
$this->line(255.1,6,255.1,23);
$this->line(275.9,6,275.9,23);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(130.3,14.5,80.6,8.5);
$this->line(130.3,18.75,210.9,18.75);
$this->line(140.7,14.5,140.7,23);
$this->line(151.1,14.5,151.1,23);
$this->line(174.5,14.5,174.5,23);
$this->line(195.3,14.5,195.3,23);
// Рамка Б1Ф3 ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$this->rect(101.7,31.5,189.8,21.25);
$this->line(101.7,44.25,291.5,44.25);
$this->line(143.3,31.5,143.3,44.25);
$this->line(203.1,31.5,203.1,44.25);
$this->line(244.7,31.5,244.7,44.25);
$this->line(114.7,44.5,114.7,46.5);
$this->line(278.5,44.25,278.5,52.75);
$this->line(268.1,44.25,268.1,52.75);
$this->line(257.7,44.25,257.7,52.75);
$this->line(247.3,44.25,247.3,52.75);
$this->SetLineWidth(0.8);
$this->rect(143.3,31.5,148.2,12.75);
$this->SetLineWidth(0.2);
// Рамка Б2Ф1 ГОСТ 3.1103-2011 Исполнители
$this->rect(5.5,31.5,96.2,21.25);
$this->line(28.9,31.5,28.9,52.75);
$this->line(65.3,31.5,65.3,52.75);
$this->line(86.1,31.5,86.1,52.75);
$this->line(5.5,35.75,101.2,35.75);
$this->line(5.5,40,101.7,40);
$this->line(5.5,44.25,101.7,44.25);
$this->line(5.5,48.5,101.7,48.5);
//Задаем шрифт
//$this->SetFont('arial','',8);
$this->setxy(5.5,31.5);
$this->SetFont('gost_a','',12);
//В ячейке 23.4х4.25 мм с разрывом строк выравнивание текста задаем по левой стороне
$this->Cell(23.4,4.25,'Разраб.',0,2,'L');
$this->Cell(23.4,4.25,'Проверил',0,2,'L');
$this->Cell(23.4,4.25,'Утвердил',0,2,'L');
$this->Cell(23.4,4.25,'',0,2,'L');
//$this->SetXY(5.5,48.5);
$this->Cell(23.4,4.25,'Н.контр.');
$this->SetXY(86.1,31.5);
$this->Cell(15.6,4.25,$today,0,1,'C');
$this->SetXY(250,2);
$this->Cell(40,4.25,'ГОСТ 3.1404-86 Форма 3',0,1,'R');
//$this->SetXY(210,4);
//$this->write(0,'ГОСТ 3.1404-86 Форма 3');
$this->line(148.5,3,148.5,11);
//$this->setxy(18.5,86.75);
//$this->Cell(273,8.5,'wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww',0,1,'L');//96
//$this->AddFont('gdt','','amgdt_iv25.php');
//$this->SetFont('gdt','',8);
//$this->SetXY(30,51);
//$this->Write(0,chr(110).chr(126).chr(96).chr(97).chr(98));
//_________________________________________________________
//вывод текста
$this->SetFont('gost_a','',12);
$this->setxy(28.9,31.5);
$this->Cell(36.4,4.25,$tp['performer'],0,2,'L');//Фамилия исполнителя
$this->Cell(36.4,4.25,$tp['cheсking'],0,2,'L');//Проверил
$this->Cell(36.4,4.25,$tp['approving'],0,2,'L');//Утвердил
$this->Cell(23.4,4.25,'',0,2,'L');
$this->Cell(36.4,4.25,$tp['normcontrol'],0,2,'L');//Н.контроль
$this->SetFont('gost_a','',14);
$this->setxy(244.7,31.5);
$this->Cell(46.8,12.75,$tp['doc'],0,1,'C');//обозначение документа по ГОСТ 3.1201
$this->setxy(101.7,31.5);
if($tp['drawing']!=null){
	$this->Image('./uploads/'.$tp['drawing'],101.7+0.5,31.5+0.5,41.6-1,12.75-1);
}
else{
	$this->Cell(41.6,12.75,$tp['flabel'],0,0,'C');//Краткое наименование или условное обозначение (код) организации (предприятия) - разработчика документа (документов)
}
$this->setxy(143.3,31.5);
$this->Cell(59.8,12.75,$ds['designation'],0,1,'C');//Обозначение изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->setxy(260.3,23);
$this->Cell(15.6,8.5,$pgs,0,0,'C');//Количество листов
//$this->setxy(275.9,23);
$this->Cell(15.6,8.5,'1',0,1,'C');//Номер листа
$this->setxy(153.7,23);
$this->Cell(59.8,8.5,$tp['product'],0,1,'C');//Обозначение изделия или классификационного кода
$this->setxy(114.7,44.25);
$this->Cell(132.6,8.5,$ds['name'],0,0,'C');//Наименование изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->SetFont('gost_a','',12);
$this->Cell(10.4,8.5,$tp['letter1'],0,0,'C');//Стадия проектирования 1
$this->Cell(10.4,8.5,$tp['letter2'],0,0,'C');//Стадия проектирования 2
$this->Cell(10.4,8.5,$tp['letter3'],0,0,'C');//Стадия проектирования 3
$this->Cell(13,8.5,sprintf('%03d',$op[0][5]),0,0,'C');//Номер операции
$this->SetFont('gost_a','',11);
$this->setxy(83.5,57);
$this->Cell(65,8.5,$ds['material'],0,0,'C');//Материал
$this->SetFont('gost_a','',12);
$this->setxy(148.5,57);
$this->Cell(28.6,8.5,$tp['hardness'],0,0,'C');//Твердость
$this->Cell(10.4,8.5,$tp['unitcode'],0,0,'C');//Единица веса
if ($tp['mass']>0){
$this->Cell(18.2,8.5,number_format($tp['mass'],2,',',''),0,0,'C');//Масса детали
}
else{$this->Cell(18.2,8.5,NULL,0,0,'C');};
$dims=str_replace(DIAM,'¤',$tp['dimensions']);
$this->Cell(54.6,8.5,$dims,0,0,'C');//Профиль и размеры
if ($tp['blankmass']>0){
$this->Cell(18.2,8.5,number_format($tp['blankmass'],2,',',''),0,0,'C');//Масса заготовки
}
else{$this->Cell(18.2,8.5,NULL,0,0,'C');};
$this->Cell(13,8.5,$tp['numdet'],0,0,'C');//КОИД
$this->setxy(5.5,57);
$this->Cell(78,8.5,$op[0][6],0,0,'C');//Наименование операции
$this->setxy(5.5,69.75);
$this->Cell(78,12.75,$op[0][15]." ".$op[0][12]."\n".$op[0][13],0,0,'C');//Оборудование, устройство ЧПУ
$this->Cell(65,12.75,$op[0][32],0,0,'C');//Обозначение программы
$this->SetFont('gost_a','',14);
if ($op[0][30]==0) $To=null; else $To=number_format($op[0][30],2,',','');
$this->Cell(18.2,12.75,$To,0,0,'C');//То
if ($op[0][31]==0) $Tv=null; else $Tv=number_format($op[0][31],2,',','');
$this->Cell(20.8,12.75,$Tv,0,0,'C');//Тв
if ($op[0][28]==0) $Tpz=null; else $Tpz=number_format($op[0][28],2,',','');
$this->cell(18.2,12.75,$Tpz,0,0,'C');//Тпз
if ($op[0][29]==0) $Tst=null; else $Tst=number_format($op[0][29],2,',','');
$this->cell(20.8,12.75,$Tst,0,0,'C');//Тшт
$this->SetFont('gost_a','',12);
$this->cell(65,12.75,$op[0][33],0,0,'C');//СОЖ
}
function PrintOK2p($tp, $ds, $pg, $nop){
//_________________________________________________________
//второй лист ОК форма 2а ГОСТ 3.1404-86
$this->AddPage('L','A4');
// Рамка B6Ф1 ГОСТ 3.1103-2011 блок вида и назначения документа
$this->rect(5.5,201.5,286,8.5);
$this->rect(5.5,201.5,23.5,8.5);
	//$this->AddFont('gost_a','','GOSTmi.php');
	$this->SetFont('gost_a','',15);	
	$this->SetXY(5.5,201.5);
	$this->Cell(23.5,8.5,'OK',0,0,'C');
	$this->Cell(246.9,8.5,'Oперационная карта',0,0,'L');
	$this->Cell(15.6,8.5,$this->PageNo(),0,0,'C');
$this->rect(297-5.5-15.6,201.5,15.6,8.5);
//Данные
$this->SetFont('gost_a','',12);
$this->rect(5.5,48.5,286,153);
for ($x=0; $x++<18;){ 
	$this->line(5.5,$x*8.5+48.5,286+5.5,$x*8.5+48.5);
	$this->line(5.5+13,$x*8.5+48.5-8.5,5.5+13,48.5+$x*8.5);
	$this->setxy(5.5+5,$x*8.5+48.5-8.5);
	$this->cell(13/2,8.5,sprintf('%02d',$x),0,1,'L');
}
$this->setXY(5.5,48.5-4.25);
$this->cell(13,4.25,'Р',1,0,'C');
$this->cell(109.2,4.25,' ',1,0,'C');
$this->cell(18.2,4.25,'ПИ',1,0,'C');
$this->cell(28.6,4.25,'D или B',1,0,'C');
$this->cell(23.4,4.25,'L',1,0,'C');
$this->cell(13,4.25,'t',1,0,'C');
$this->cell(15.6,4.25,'i',1,0,'C');
$this->cell(26,4.25,'s',1,0,'C');
$this->cell(18.2,4.25,'n',1,0,'C');
$this->cell(20.8,4.25,'v',1,0,'C');
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$this->rect(5.5,10.25,75.4,12.75);
$this->line(5.5,14.5,80.9,14.5);
$this->line(5.5,18.75,80.9,18.75);
$this->line(23.7,10.25,23.7,14.5);
$this->line(44.5,10.25,44.5,14.5);
$this->line(65.3,10.25,65.3,14.5);
$this->line(23.7,18.75,23.7,23);
$this->line(44.5,18.75,44.5,23);
$this->line(65.3,18.75,65.3,23);
$this->setxy(5.5,10.25);
$this->SetFont('gost_a','',12);
$this->Cell(18.2,4.25,'Дубл.',1,2,'L');
$this->Cell(18.2,4.25,'Взам.',1,2,'L');
$this->Cell(18.2,4.25,'Подп.',1,2,'L');
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(210.9,6,80.6,17);
$this->line(210.9,10.25,291.5,10.25);
$this->line(210.9,14.5,291.5,14.5);
$this->line(210.9,18.75,291.5,18.75);
$this->line(221.3,6,221.3,23);
$this->line(231.6,6,231.6,23);
$this->line(255.1,6,255.1,23);
$this->line(275.9,6,275.9,23);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(130.3,14.5,80.6,8.5);
$this->line(130.3,18.75,210.9,18.75);
$this->line(140.7,14.5,140.7,23);
$this->line(151.1,14.5,151.1,23);
$this->line(174.5,14.5,174.5,23);
$this->line(195.3,14.5,195.3,23);
// Рамка Б1Ф3а ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$this->rect(171.9,31.5,119.6,12.75);
$this->line(278.5,31.5,278.5,44.25);
$this->line(231.7,31.5,231.7,44.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(91.3,31.5,80.6,12.75);
$this->line(91.3,35.75,171.9,35.75);
$this->line(91.3,40,171.9,40);
$this->line(156.3,31.5,156.3,44.25);
$this->line(135.5,31.5,135.5,44.25);
$this->line(112.1,31.5,112.1,44.25);
$this->line(101.7,31.5,101.7,44.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(10.7,31.5,80.6,12.75);
$this->line(10.7,35.75,91.3,35.75);
$this->line(10.7,40,91.3,40);
$this->line(75.7,31.5,75.7,44.25);
$this->line(54.9,31.5,54.9,44.25);
$this->line(31.5,31.5,31.5,44.25);
$this->line(21.1,31.5,21.1,44.25);
$this->rect(5.5,31.5,5.2,12.75);
// Рамка Б5Ф1а ГОСТ 3.1103-2011 блок вспомогательной информации
$this->rect(5.5,23,286,8.5);
$this->line(275.9,23,275.9,31.5);
$this->line(229.1,23,229.1,31.5);
$this->line(169.3,23,169.3,26);
$this->SetXY(250,2);
$this->Cell(40,4.25,'ГОСТ 3.1404-86 Форма 2а',0,1,'R');
//$this->SetXY(210,4);
//$this->write(0,'ГОСТ 3.1404-86 Форма 2а');
$this->line(148.5,3,148.5,11);
//_________________________________________________________
//вывод текста
$this->SetFont('gost_a','',14);
$this->setxy(184.9-13,31.5);
$this->Cell(59.8,12.75,$ds['designation'],0,0,'C');//Обозначение изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->Cell(46.8,12.75,$tp['doc'],0,0,'C');//обозначение документа по ГОСТ 3.1201

$this->Cell(13,12.75,sprintf('%03d',$nop),0,0,'C');//Номер операции
$this->setxy(153.7+15.6,23);
$this->Cell(59.8,8.5,$tp['product'],0,1,'C');//Обозначение изделия или классификационного кода
$this->setxy(275.9,23);
$this->Cell(15.6,8.5,$pg,0,1,'C');//Номер листа
}
//============================================================================================================
//=== Карта эскизов A4 ===
//============================================================================================================
function PrintKEA4_1p($tp, $ds, $pgs, $nop, $imgf){
$today=Date("d.m.y",strtotime($tp['tpdate']));
//ГОСТ 3.1105-84 КЭ Форма 7 (Заглавный лист)
//$this->AddFont('gost_a','','GOSTmi.php');
$this->SetFont('gost_a','',12);
$this->SetAutoPageBreak(true,0);
$this->SetMargins(5.5,0,5.5);
$this->SetTextColor( 0, 0, 0);
$this->AddPage('L','A4');
// Рамка B6Ф1 ГОСТ 3.1103-82 блок вида и назначения документа
$this->rect(5.5,201.5,286,8.5);
$this->rect(5.5,201.5,23.5,8.5);
	$this->SetFont('gost_a','',15);	
	$this->SetXY(5.5,201.5);
	$this->Cell(23.5,8.5,'КЭ',0,0,'C');
	$this->Cell(246.9,8.5,'Карта эскизов',0,0,'L');
	$this->Cell(15.6,8.5,$this->PageNo(),0,0,'C');
$this->rect(297-5.5-15.6,201.5,15.6,8.5);
//Данные
$this->SetFont('gost_a','',12);
$this->rect(5.5,52.75,286,148.75);

// Рамка Б5Ф1 ГОСТ 3.1103-2011 блок вспомогательной информации
$this->rect(5.5,23,286,8.5);
$this->line(275.9,23,275.9,31.5);
$this->line(260.3,23,260.3,31.5);
$this->line(213.5,23,213.5,31.5);
$this->line(153.7,23,153.7,26);
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$this->rect(5.5,10.25,75.4,12.75);
$this->line(5.5,14.5,80.9,14.5);
$this->line(5.5,18.75,80.9,18.75);
$this->line(23.7,10.25,23.7,14.5);
$this->line(44.5,10.25,44.5,14.5);
$this->line(65.3,10.25,65.3,14.5);
$this->line(23.7,18.75,23.7,23);
$this->line(44.5,18.75,44.5,23);
$this->line(65.3,18.75,65.3,23);
$this->setxy(5.5,10.25);
$this->SetFont('gost_a','',12);
$this->Cell(18.2,4.25,'Дубл.',1,2,'L');
$this->Cell(18.2,4.25,'Взам.',1,2,'L');
$this->Cell(18.2,4.25,'Подп.',1,2,'L');
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(210.9,6,80.6,17);
$this->line(210.9,10.25,291.5,10.25);
$this->line(210.9,14.5,291.5,14.5);
$this->line(210.9,18.75,291.5,18.75);
$this->line(221.3,6,221.3,23);
$this->line(231.6,6,231.6,23);
$this->line(255.1,6,255.1,23);
$this->line(275.9,6,275.9,23);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(130.3,14.5,80.6,8.5);
$this->line(130.3,18.75,210.9,18.75);
$this->line(140.7,14.5,140.7,23);
$this->line(151.1,14.5,151.1,23);
$this->line(174.5,14.5,174.5,23);
$this->line(195.3,14.5,195.3,23);
// Рамка Б1Ф3 ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$this->rect(101.7,31.5,189.8,21.25);
$this->line(101.7,44.25,291.5,44.25);
$this->line(143.3,31.5,143.3,44.25);
$this->line(203.1,31.5,203.1,44.25);
$this->line(244.7,31.5,244.7,44.25);
$this->line(114.7,44.5,114.7,46.5);
$this->line(278.5,44.25,278.5,52.75);
$this->line(268.1,44.25,268.1,52.75);
$this->line(257.7,44.25,257.7,52.75);
$this->line(247.3,44.25,247.3,52.75);
$this->SetLineWidth(0.8);
$this->rect(143.3,31.5,148.2,12.75);
$this->SetLineWidth(0.2);
// Рамка Б2Ф1 ГОСТ 3.1103-2011 Исполнители
$this->rect(5.5,31.5,96.2,21.25);
$this->line(28.9,31.5,28.9,52.75);
$this->line(60.3,31.5,60.3,52.75);
$this->line(86.1,31.5,86.1,52.75);
$this->line(5.5,35.75,101.2,35.75);
$this->line(5.5,40,101.7,40);
$this->line(5.5,44.25,101.7,44.25);
$this->line(5.5,48.5,101.7,48.5);
//Задаем шрифт
//$this->SetFont('arial','',8);
$this->setxy(5.5,31.5);
$this->SetFont('gost_a','',12);
//В ячейке 23.4х4.25 мм с разрывом строк выравнивание текста задаем по левой стороне
$this->Cell(23.4,4.25,'Разраб.',0,2,'L');
$this->Cell(23.4,4.25,'Проверил',0,2,'L');
$this->Cell(23.4,4.25,'Утвердил',0,2,'L');
$this->Cell(23.4,4.25,'',0,2,'L');
//$this->SetXY(5.5,48.5);
$this->Cell(23.4,4.25,'Н.контр.');
$this->SetXY(86.1,31.5);
$this->Cell(15.6,4.25,$today,0,1,'C');
$this->SetXY(250,2);
$this->Cell(40,4.25,'ГОСТ 3.1105-84 Форма 7',0,1,'R');
//$this->SetXY(250,2);
//$this->Cell(40,4.25,'ГОСТ 3.1105-84 Форма 7',0,1,'R');
//$this->write(0,'ГОСТ 3.1105-84 Форма 7');
$this->line(148.5,3,148.5,11);
//$imgf='D:\xampp\htdocs\test5\img\default-preview.jpg';
if (!$imgf=='') $this->Image($imgf,6,53,285,148);
//_________________________________________________________
//вывод текста
$this->SetFont('gost_a','',12);
$this->setxy(28.9,31.5);
$this->Cell(36.4,4.25,$tp['performer'],0,2,'L');//Фамилия исполнителя
$this->Cell(36.4,4.25,$tp['cheсking'],0,2,'L');//Проверил
$this->Cell(36.4,4.25,$tp['approving'],0,2,'L');//Утвердил
$this->Cell(23.4,4.25,'',0,2,'L');
$this->Cell(36.4,4.25,$tp['normcontrol'],0,2,'L');//Н.контроль
$this->SetFont('gost_a','',14);
$this->setxy(244.7,31.5);
$this->Cell(46.8,12.75,$tp['doc'],0,1,'C');//обозначение документа по ГОСТ 3.1201
$this->setxy(101.7,31.5);
if($tp['drawing']!=null){
	$this->Image('./uploads/'.$tp['drawing'],101.7+0.5,31.5+0.5,41.6-1,12.75-1);
}
else{
	$this->Cell(41.6,12.75,$tp['flabel'],0,0,'C');//Краткое наименование или условное обозначение (код) организации (предприятия) - разработчика документа (документов)
}
$this->setxy(143.3,31.5);
$this->Cell(59.8,12.75,$ds['designation'],0,1,'C');//Обозначение изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->setxy(260.3,23);
$this->Cell(15.6,8.5,$pgs,0,0,'C');//Количество листов
//$this->setxy(275.9,23);
$this->Cell(15.6,8.5,'1',0,1,'C');//Номер листа
$this->setxy(153.7,23);
$this->Cell(59.8,8.5,$tp['product'],0,1,'C');//Обозначение изделия или классификационного кода
$this->setxy(114.7,44.25);
$this->Cell(132.6,8.5,$ds['name'],0,0,'C');//Наименование изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->SetFont('gost_a','',12);
$this->Cell(10.4,8.5,$tp['letter1'],0,0,'C');//Стадия проектирования 1
$this->Cell(10.4,8.5,$tp['letter2'],0,0,'C');//Стадия проектирования 2
$this->Cell(10.4,8.5,$tp['letter3'],0,0,'C');//Стадия проектирования 3
$this->Cell(13,8.5,sprintf('%03d',$nop),0,0,'C');//Номер операции
}
function PrintKEA4_2p($tp, $ds, $pg, $nop, $imgf){
//_________________________________________________________
//второй лист КЭ форма 7а ГОСТ 3.1105-84
$this->AddPage('L','A4');
// Рамка B6Ф1 ГОСТ 3.1103-2011 блок вида и назначения документа
$this->rect(5.5,201.5,286,8.5);
$this->rect(5.5,201.5,23.5,8.5);
	//$this->AddFont('gost_a','','GOSTmi.php');
	$this->SetFont('gost_a','',15);	
	$this->SetXY(5.5,201.5);
	$this->Cell(23.5,8.5,'КЭ',0,0,'C');
	$this->Cell(246.9,8.5,'Карта эскизов',0,0,'L');
	$this->Cell(15.6,8.5,$this->PageNo(),0,0,'C');
$this->rect(297-5.5-15.6,201.5,15.6,8.5);
//Данные
$this->SetFont('gost_a','',12);
$this->rect(5.5,44.25,286,157.25);

// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$this->rect(5.5,10.25,75.4,12.75);
$this->line(5.5,14.5,80.9,14.5);
$this->line(5.5,18.75,80.9,18.75);
$this->line(23.7,10.25,23.7,14.5);
$this->line(44.5,10.25,44.5,14.5);
$this->line(65.3,10.25,65.3,14.5);
$this->line(23.7,18.75,23.7,23);
$this->line(44.5,18.75,44.5,23);
$this->line(65.3,18.75,65.3,23);
$this->setxy(5.5,10.25);
$this->SetFont('gost_a','',12);
$this->Cell(18.2,4.25,'Дубл.',1,2,'L');
$this->Cell(18.2,4.25,'Взам.',1,2,'L');
$this->Cell(18.2,4.25,'Подп.',1,2,'L');
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(210.9,6,80.6,17);
$this->line(210.9,10.25,291.5,10.25);
$this->line(210.9,14.5,291.5,14.5);
$this->line(210.9,18.75,291.5,18.75);
$this->line(221.3,6,221.3,23);
$this->line(231.6,6,231.6,23);
$this->line(255.1,6,255.1,23);
$this->line(275.9,6,275.9,23);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(130.3,14.5,80.6,8.5);
$this->line(130.3,18.75,210.9,18.75);
$this->line(140.7,14.5,140.7,23);
$this->line(151.1,14.5,151.1,23);
$this->line(174.5,14.5,174.5,23);
$this->line(195.3,14.5,195.3,23);
// Рамка Б1Ф3а ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$this->rect(171.9,31.5,119.6,12.75);
$this->line(278.5,31.5,278.5,44.25);
$this->line(231.7,31.5,231.7,44.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(91.3,31.5,80.6,12.75);
$this->line(91.3,35.75,171.9,35.75);
$this->line(91.3,40,171.9,40);
$this->line(156.3,31.5,156.3,44.25);
$this->line(135.5,31.5,135.5,44.25);
$this->line(112.1,31.5,112.1,44.25);
$this->line(101.7,31.5,101.7,44.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(10.7,31.5,80.6,12.75);
$this->line(10.7,35.75,91.3,35.75);
$this->line(10.7,40,91.3,40);
$this->line(75.7,31.5,75.7,44.25);
$this->line(54.9,31.5,54.9,44.25);
$this->line(31.5,31.5,31.5,44.25);
$this->line(21.1,31.5,21.1,44.25);
$this->rect(5.5,31.5,5.2,12.75);
// Рамка Б5Ф1а ГОСТ 3.1103-2011 блок вспомогательной информации
$this->rect(5.5,23,286,8.5);
$this->line(275.9,23,275.9,31.5);
$this->line(229.1,23,229.1,31.5);
$this->line(169.3,23,169.3,26);
$this->SetXY(250,2);
$this->Cell(40,4.25,'ГОСТ 3.1105-84 Форма 7а',0,1,'R');
//$this->SetXY(210,4);
//$this->write(0,'ГОСТ 3.1105-84 Форма 7а');
$this->line(148.5,3,148.5,11);
if (!$imgf=='') $this->Image($imgf,6,53-8.5,285,148);
//_________________________________________________________
//вывод текста
$this->SetFont('gost_a','',14);
$this->setxy(184.9-13,31.5);
$this->Cell(59.8,12.75,$ds['designation'],0,0,'C');//Обозначение изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->Cell(46.8,12.75,$tp['doc'],0,0,'C');//обозначение документа по ГОСТ 3.1201

$this->Cell(13,12.75,sprintf('%03d',$nop),0,0,'C');//Номер операции
$this->setxy(153.7+15.6,23);
$this->Cell(59.8,8.5,$tp['product'],0,1,'C');//Обозначение изделия или классификационного кода
$this->setxy(275.9,23);
$this->Cell(15.6,8.5,$pg,0,1,'C');//Номер листа
}
//============================================================================================================
//=== Карта эскизов A3 ===
//============================================================================================================
function PrintKEA3_1p($tp, $ds, $pgs, $nop, $imgf){
$today=Date("d.m.y",strtotime($tp['tpdate']));
//ГОСТ 3.1105-2011 КЭ Форма 8 (Заглавный лист)
//$this->AddFont('gost_a','','GOSTmi.php');
$this->SetFont('gost_a','',12);
$this->SetAutoPageBreak(true,0);
$this->SetMargins(5,0,5);
$this->SetTextColor( 0, 0, 0);
$this->AddPage('L','A3');
// Рамка B6Ф1 ГОСТ 3.1103-82 блок вида и назначения документа
$this->rect(20,283.5,395,8.5);
$this->rect(20,283.5,23.5,8.5);
	$this->SetFont('gost_a','',15);	
	$this->SetXY(20,283.5);
	$this->Cell(23.5,8.5,'КЭ',0,0,'C');
	$this->Cell(356,8.5,'Карта эскизов',0,0,'L');
	$this->Cell(15.6,8.5,$this->PageNo(),0,0,'C');
$this->rect(399.4,283.5,15.6,8.5);
//Данные
$this->SetFont('gost_a','',12);
$this->rect(20,34.75,395,248.75);
// Рамка Б5Ф1 ГОСТ 3.1103-2011 блок вспомогательной информации
$this->rect(20,5,395,8.5);
$this->line(277.2,5,277.2,8);
$this->line(337,5,337,13.5);
$this->line(383.8,5,383.8,13.5);
$this->line(399.4,5,399.4,13.5);
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$this->rect(7.25,216.6,12.75,75.4);
$this->line(7.25,232.2,11.5,232.2);
$this->line(15.75,232.2,20,232.2);
$this->line(7.25,248,11.5,248);
$this->line(15.75,248,20,248);
$this->line(7.25,268.8,20,268.8);
$this->line(11.5,216.6,11.5,292);
$this->line(15.75,216.6,15.75,292);
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(3,5,17,80.6);
$this->line(7.25,5,7.25,85.6);
$this->line(11.5,5,11.5,85.6);
$this->line(15.75,5,15.75,85.6);
$this->line(3,20.6,20,20.6);
$this->line(3,41.4,20,41.4);
$this->line(3,64.8,20,64.8);
$this->line(3,75.2,20,75.2);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(11.5,85.6,8.5,80.6);
$this->line(15.75,85.6,15.75,166.2);
$this->line(11.5,101.2,20,101.2);
$this->line(11.5,122,20,122);
$this->line(11.5,145.4,20,145.4);
$this->line(11.5,155.8,20,155.8);
// Рамка Б3Ф1 ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(48.4,13.5,80.6,21.25);
$this->line(48.4,17.75,129,17.75);
$this->line(48.4,22,129,22);
$this->line(48.4,26.25,129,26.25);
$this->line(48.4,30.5,129,30.5);
$this->line(58.8,13.5,58.8,34.75);
$this->line(69.2,13.5,69.2,34.75);
$this->line(92.6,13.5,92.6,34.75);
$this->line(113.4,13.5,113.4,34.75);
// Рамка Б1Ф3 ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$this->rect(225.2,13.5,189.8,12.75);
$this->line(266.8,13.5,266.8,26.25);
$this->line(326.6,13.5,326.6,26.25);
$this->line(368.2,13.5,368.2,26.25);
$this->line(238.2,26.25,238.2,29.25);
$this->line(370.8,26.25,370.8,34.75);
$this->line(381.2,26.25,381.2,34.75);
$this->line(391.6,26.25,391.6,34.75);
$this->line(402,26.25,402,34.75);
$this->line(415,26.25,415,34.75);
$this->SetLineWidth(0.8);
$this->rect(266.8,13.5,148.2,12.75);
$this->SetLineWidth(0.2);
// Рамка Б2Ф1 ГОСТ 3.1103-2011 Исполнители
$this->rect(129,13.5,96.2,21.25);
$this->line(129,17.75,225.2,17.75);
$this->line(129,22,225.2,22);
$this->line(129,26.25,225.2,26.25);
$this->line(129,30.5,225.2,30.5);
$this->line(152.4,13.5,152.4,34.75);
$this->line(188.8,13.5,188.8,34.75);
$this->line(209.6,13.5,209.6,34.75);
//Задаем шрифт
//$this->SetFont('arial','',8);
$this->setxy(129,13.5);
$this->SetFont('gost_a','',12);
//В ячейке 23.4х4.25 мм с разрывом строк выравнивание текста задаем по левой стороне
$this->Cell(23.4,4.25,'Разраб.',0,2,'L');
$this->Cell(23.4,4.25,'Проверил',0,2,'L');
$this->Cell(23.4,4.25,'Утвердил',0,2,'L');
$this->Cell(23.4,4.25,'',0,2,'L');
//$this->SetXY(5.5,48.5);
$this->Cell(23.4,4.25,'Н.контр.');
$this->SetXY(209.6,13.5);
$this->Cell(15.6,4.25,$today,0,1,'C');
$this->SetXY(373,1);
$this->Cell(40,4.25,'ГОСТ 3.1105-2011 Форма 8',0,1,'R');
$this->line(0,297/2,5,297/2);
//изображение
if (!$imgf=='') $this->Image($imgf,20.5,35.25,394,248);
//_________________________________________________________
//вывод текста
$this->SetFont('gost_a','',12);
$this->setxy(152.4,13.5);
$this->Cell(36.4,4.25,$tp['performer'],0,2,'L');//Фамилия исполнителя
$this->Cell(36.4,4.25,$tp['cheсking'],0,2,'L');//Проверил
$this->Cell(36.4,4.25,$tp['approving'],0,2,'L');//Утвердил
$this->Cell(23.4,4.25,'',0,2,'L');
$this->Cell(36.4,4.25,$tp['normcontrol'],0,2,'L');//Н.контроль
$this->SetFont('gost_a','',14);
$this->setxy(368.2,13.5);
$this->Cell(46.8,12.75,$tp['doc'],0,1,'C');//обозначение документа по ГОСТ 3.1201
$this->setxy(225.2,13.5);
if($tp['drawing']!=null){
	$this->Image('./uploads/'.$tp['drawing'],225.2+0.5,13.5+0.5,41.6-1,12.75-1);
}
else{
	$this->Cell(41.6,12.75,$tp['flabel'],0,0,'C');//Краткое наименование или условное обозначение (код) организации (предприятия) - разработчика документа (документов)
}
$this->setxy(266.8,13.5);
$this->Cell(59.8,12.75,$ds['designation'],0,1,'C');//Обозначение изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->setxy(383.8,5);
$this->Cell(15.6,8.5,$pgs,0,0,'C');//Количество листов
//$this->setxy(275.9,23);
$this->Cell(15.6,8.5,'1',0,1,'C');//Номер листа
$this->setxy(277.2,5);
$this->Cell(59.8,8.5,$tp['product'],0,1,'C');//Обозначение изделия или классификационного кода
$this->setxy(238.2,26.25);
$this->Cell(132.6,8.5,$ds['name'],0,0,'C');//Наименование изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->SetFont('gost_a','',12);
$this->Cell(10.4,8.5,$tp['letter1'],0,0,'C');//Стадия проектирования 1
$this->Cell(10.4,8.5,$tp['letter2'],0,0,'C');//Стадия проектирования 2
$this->Cell(10.4,8.5,$tp['letter3'],0,0,'C');//Стадия проектирования 3
$this->Cell(13,8.5,sprintf('%03d',$nop),0,0,'C');//Номер операции
}
function PrintKEA3_2p($tp, $ds, $pg, $nop, $imgf){
//_________________________________________________________
//второй лист КЭ форма 8а ГОСТ 3.1105-84
//
//$this->AddFont('gost_a','','GOSTmi.php');
$this->SetFont('gost_a','',12);
$this->SetAutoPageBreak(true,0);
$this->SetMargins(5,0,5);
$this->SetTextColor( 0, 0, 0);
$this->AddPage('L','A3');
// Рамка B6Ф1 ГОСТ 3.1103-82 блок вида и назначения документа
$this->rect(20,283.5,395,8.5);
$this->rect(20,283.5,23.5,8.5);
	$this->SetFont('gost_a','',15);	
	$this->SetXY(20,283.5);
	$this->Cell(23.5,8.5,'КЭ',0,0,'C');
	$this->Cell(356,8.5,'Карта эскизов',0,0,'L');
	$this->Cell(15.6,8.5,$this->PageNo(),0,0,'C');
$this->rect(399.4,283.5,15.6,8.5);
//Данные
$this->SetFont('gost_a','',12);
$this->rect(20,26.25,395,257.25);
// Рамка Б5Ф1а ГОСТ 3.1103-2011 блок вспомогательной информации
$this->rect(20,5,395,8.5);
$this->line(292.8,5,292.8,8);
$this->line(352.6,5,352.6,13.5);
$this->line(399.4,5,399.4,13.5);
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$this->rect(7.25,216.6,12.75,75.4);
$this->line(7.25,232.2,11.5,232.2);
$this->line(15.75,232.2,20,232.2);
$this->line(7.25,248,11.5,248);
$this->line(15.75,248,20,248);
$this->line(7.25,268.8,20,268.8);
$this->line(11.5,216.6,11.5,292);
$this->line(15.75,216.6,15.75,292);
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(3,5,17,80.6);
$this->line(7.25,5,7.25,85.6);
$this->line(11.5,5,11.5,85.6);
$this->line(15.75,5,15.75,85.6);
$this->line(3,20.6,20,20.6);
$this->line(3,41.4,20,41.4);
$this->line(3,64.8,20,64.8);
$this->line(3,75.2,20,75.2);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(11.5,85.6,8.5,80.6);
$this->line(15.75,85.6,15.75,166.2);
$this->line(11.5,101.2,20,101.2);
$this->line(11.5,122,20,122);
$this->line(11.5,145.4,20,145.4);
$this->line(11.5,155.8,20,155.8);
// Рамка Б1Ф3а ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$this->rect(295.4,13.5,119.6,12.75);
$this->line(355.2,13.5,355.2,26.25);
$this->line(402,13.5,402,26.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(214.8,13.5,80.6,12.75);
$this->line(214.8,17.75,295.4,17.75);
$this->line(214.8,22,295.4,22);
$this->line(225.2,13.5,225.2,26.25);
$this->line(235.6,13.5,235.6,26.25);
$this->line(259,13.5,259,26.25);
$this->line(279.8,13.5,279.8,26.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(134.2,13.5,80.6,12.75);
$this->line(134.2,17.75,214.8,17.75);
$this->line(134.2,22,214.8,22);
$this->line(144.6,13.5,144.6,26.25);
$this->line(155,13.5,155,26.25);
$this->line(178.4,13.5,178.4,26.25);
$this->line(199.2,13.5,199.2,26.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(53.6,13.5,80.6,12.75);
$this->line(53.6,17.75,134.2,17.75);
$this->line(53.6,22,134.2,22);
$this->line(64,13.5,64,26.25);
$this->line(74.4,13.5,74.4,26.25);
$this->line(97.8,13.5,97.8,26.25);
$this->line(118.6,13.5,118.6,26.25);
//
$this->SetXY(373,1);
$this->Cell(40,4.25,'ГОСТ 3.1105-2011 Форма 8а',0,1,'R');
//  Выводим изображение
if (!$imgf=='') $this->Image($imgf,20.5,26.75,394,248);
//_________________________________________________________
//вывод текста
$this->SetFont('gost_a','',14);
$this->setxy(295.4,13.5);
$this->Cell(59.8,12.75,$ds['designation'],0,0,'C');//Обозначение изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->Cell(46.8,12.75,$tp['doc'],0,0,'C');//обозначение документа по ГОСТ 3.1201
$this->Cell(13,12.75,sprintf('%03d',$nop),0,0,'C');//Номер операции
$this->setxy(292.8,5);
$this->Cell(59.8,8.5,$tp['product'],0,1,'C');//Обозначение изделия или классификационного кода
$this->setxy(399.4,5);
$this->Cell(15.6,8.5,$pg,0,1,'C');//Номер листа
}
//============================================================================================================
//=== Карта наладки ===
//============================================================================================================
function PrintKN1p($tp, $ds, $pgs, $nop, $kn, $countKN){
$today=Date("d.m.y",strtotime($tp['tpdate']));
//ГОСТ 3.1105-84 КН Форма 7 (Заглавный лист)
//$this->AddFont('gost_a','','GOSTmi.php');
$this->SetFont('gost_a','',12);
$this->SetAutoPageBreak(true,0);
$this->SetMargins(5.5,0,5.5);
$this->SetTextColor( 0, 0, 0);
$this->AddPage('L','A4');
// Рамка B6Ф1 ГОСТ 3.1103-82 блок вида и назначения документа
$this->rect(5.5,201.5,286,8.5);
$this->rect(5.5,201.5,23.5,8.5);
	$this->SetFont('gost_a','',15);	
	$this->SetXY(5.5,201.5);
	$this->Cell(23.5,8.5,'КН',0,0,'C');
	$this->Cell(246.9,8.5,'Карта наладки',0,0,'L');
	$this->Cell(15.6,8.5,$this->PageNo(),0,0,'C');
$this->rect(297-5.5-15.6,201.5,15.6,8.5);
//Данные
$this->SetFont('gost_a','',12);
$this->rect(5.5,52.75,286,148.75);

// Рамка Б5Ф1 ГОСТ 3.1103-2011 блок вспомогательной информации
$this->rect(5.5,23,286,8.5);
$this->line(275.9,23,275.9,31.5);
$this->line(260.3,23,260.3,31.5);
$this->line(213.5,23,213.5,31.5);
$this->line(153.7,23,153.7,26);
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$this->rect(5.5,10.25,75.4,12.75);
$this->line(5.5,14.5,80.9,14.5);
$this->line(5.5,18.75,80.9,18.75);
$this->line(23.7,10.25,23.7,14.5);
$this->line(44.5,10.25,44.5,14.5);
$this->line(65.3,10.25,65.3,14.5);
$this->line(23.7,18.75,23.7,23);
$this->line(44.5,18.75,44.5,23);
$this->line(65.3,18.75,65.3,23);
$this->setxy(5.5,10.25);
$this->SetFont('gost_a','',12);
$this->Cell(18.2,4.25,'Дубл.',1,2,'L');
$this->Cell(18.2,4.25,'Взам.',1,2,'L');
$this->Cell(18.2,4.25,'Подп.',1,2,'L');
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(210.9,6,80.6,17);
$this->line(210.9,10.25,291.5,10.25);
$this->line(210.9,14.5,291.5,14.5);
$this->line(210.9,18.75,291.5,18.75);
$this->line(221.3,6,221.3,23);
$this->line(231.6,6,231.6,23);
$this->line(255.1,6,255.1,23);
$this->line(275.9,6,275.9,23);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(130.3,14.5,80.6,8.5);
$this->line(130.3,18.75,210.9,18.75);
$this->line(140.7,14.5,140.7,23);
$this->line(151.1,14.5,151.1,23);
$this->line(174.5,14.5,174.5,23);
$this->line(195.3,14.5,195.3,23);
// Рамка Б1Ф3 ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$this->rect(101.7,31.5,189.8,21.25);
$this->line(101.7,44.25,291.5,44.25);
$this->line(143.3,31.5,143.3,44.25);
$this->line(203.1,31.5,203.1,44.25);
$this->line(244.7,31.5,244.7,44.25);
$this->line(114.7,44.5,114.7,46.5);
$this->line(278.5,44.25,278.5,52.75);
$this->line(268.1,44.25,268.1,52.75);
$this->line(257.7,44.25,257.7,52.75);
$this->line(247.3,44.25,247.3,52.75);
$this->SetLineWidth(0.8);
$this->rect(143.3,31.5,148.2,12.75);
$this->SetLineWidth(0.2);
// Рамка Б2Ф1 ГОСТ 3.1103-2011 Исполнители
$this->rect(5.5,31.5,96.2,21.25);
$this->line(28.9,31.5,28.9,52.75);
$this->line(60.3,31.5,60.3,52.75);
$this->line(86.1,31.5,86.1,52.75);
$this->line(5.5,35.75,101.2,35.75);
$this->line(5.5,40,101.7,40);
$this->line(5.5,44.25,101.7,44.25);
$this->line(5.5,48.5,101.7,48.5);
//Задаем шрифт
//$this->SetFont('arial','',8);
$this->setxy(5.5,31.5);
$this->SetFont('gost_a','',12);
//В ячейке 23.4х4.25 мм с разрывом строк выравнивание текста задаем по левой стороне
$this->Cell(23.4,4.25,'Разраб.',0,2,'L');
$this->Cell(23.4,4.25,'Проверил',0,2,'L');
$this->Cell(23.4,4.25,'Утвердил',0,2,'L');
$this->Cell(23.4,4.25,'',0,2,'L');
//$this->SetXY(5.5,48.5);
$this->Cell(23.4,4.25,'Н.контр.');
$this->SetXY(86.1,31.5);
$this->Cell(15.6,4.25,$today,0,1,'C');
$this->SetXY(250,2);
$this->Cell(40,4.25,'ГОСТ 3.1105-84 Форма 7',0,1,'R');
//$this->SetXY(250,2);
//$this->Cell(40,4.25,'ГОСТ 3.1105-84 Форма 7',0,1,'R');
//$this->write(0,'ГОСТ 3.1105-84 Форма 7');
$this->line(148.5,3,148.5,11);
//$imgf='D:\xampp\htdocs\test5\img\default-preview.jpg';
//if (!$imgf=='') $this->Image($imgf,6,53,285,148);
//
$this->line(5.5,57,291.5,57);
$this->line(5.5,65.5,291.5,65.5);
$this->line(5.5,74,291.5,74);
$this->line(5.5,82.5,291.5,82.5);
$this->line(5.5,91,291.5,91);
$this->line(5.5,99.5,291.5,99.5);
$this->line(5.5,108,291.5,108);
$this->line(5.5,116.5,291.5,116.5);
$this->line(5.5,125,291.5,125);
$this->line(5.5,129.25,291.5,129.25);
$this->line(5.5,133.5,291.5,133.5);
$this->line(5.5,137.75,291.5,137.75);
$this->line(60,125,60,137.75);
$this->line(131.5,125,131.5,137.75);
$this->line(203,125,203,137.75);
$this->line(274.5,125,274.5,137.75);

$this->line(77,52.75,77,201.5);
$this->line(148.5,52.75,148.5,201.5);
$this->line(220,52.75,220,201.5);

$this->setxy(5.5,125);
$this->Cell(54.5,4.25,'Рабочая позиция',0,2,'L');
$this->Cell(54.5,4.25,'Вылет инструмента (L)',0,2,'L');
$this->Cell(54.5,4.25,'Время работы, мин',0,2,'L');
$this->setxy(77,125);
$this->Cell(54.5,4.25,'Рабочая позиция',0,2,'L');
$this->Cell(54.5,4.25,'Вылет инструмента (L)',0,2,'L');
$this->Cell(54.5,4.25,'Время работы, мин',0,2,'L');
$this->setxy(148.5,125);
$this->Cell(54.5,4.25,'Рабочая позиция',0,2,'L');
$this->Cell(54.5,4.25,'Вылет инструмента (L)',0,2,'L');
$this->Cell(54.5,4.25,'Время работы, мин',0,2,'L');
$this->setxy(220,125);
$this->Cell(54.5,4.25,'Рабочая позиция',0,2,'L');
$this->Cell(54.5,4.25,'Вылет инструмента (L)',0,2,'L');
$this->Cell(54.5,4.25,'Время работы, мин',0,2,'L');
//_________________________________________________________
//вывод текста
$this->SetFont('gost_a','',12);
$this->setxy(28.9,31.5);
$this->Cell(36.4,4.25,$tp['performer'],0,2,'L');//Фамилия исполнителя
$this->Cell(36.4,4.25,$tp['cheсking'],0,2,'L');//Проверил
$this->Cell(36.4,4.25,$tp['approving'],0,2,'L');//Утвердил
$this->Cell(23.4,4.25,'',0,2,'L');
$this->Cell(36.4,4.25,$tp['normcontrol'],0,2,'L');//Н.контроль
$this->SetFont('gost_a','',14);
$this->setxy(244.7,31.5);
$this->Cell(46.8,12.75,$tp['doc'],0,1,'C');//обозначение документа по ГОСТ 3.1201
$this->setxy(101.7,31.5);
if($tp['drawing']!=null){
	$this->Image('./uploads/'.$tp['drawing'],101.7+0.5,31.5+0.5,41.6-1,12.75-1);
}
else{
	$this->Cell(41.6,12.75,$tp['flabel'],0,0,'C');//Краткое наименование или условное обозначение (код) организации (предприятия) - разработчика документа (документов)
}
$this->setxy(143.3,31.5);
$this->Cell(59.8,12.75,$ds['designation'],0,1,'C');//Обозначение изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->setxy(260.3,23);
$this->Cell(15.6,8.5,$pgs,0,0,'C');//Количество листов
//$this->setxy(275.9,23);
$this->Cell(15.6,8.5,'1',0,1,'C');//Номер листа
$this->setxy(153.7,23);
$this->Cell(59.8,8.5,$tp['product'],0,1,'C');//Обозначение изделия или классификационного кода
$this->setxy(114.7,44.25);
$this->Cell(132.6,8.5,$ds['name'],0,0,'C');//Наименование изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->SetFont('gost_a','',12);
$this->Cell(10.4,8.5,$tp['letter1'],0,0,'C');//Стадия проектирования 1
$this->Cell(10.4,8.5,$tp['letter2'],0,0,'C');//Стадия проектирования 2
$this->Cell(10.4,8.5,$tp['letter3'],0,0,'C');//Стадия проектирования 3
$this->Cell(13,8.5,sprintf('%03d',$nop),0,0,'C');//Номер операции
for ($p=0; $p<4 and $p<$countKN; $p++){
	$this->setxy(5.5+71.5*$p,52.75);//№ п/п
	$this->Cell(71.5,4.25,$p+1,0,2,'C');
	$this->SetFont('gost_a','',10);
	for ($r=1; $r<9; $r++){
		$this->setxy(5.5+71.5*$p,57+8.5*$r-8.5);	
		$i2=str_replace(DIAM,'¤',$kn[$p][27+$r]);
		$this->MultiCell(71.5+30,4.25,$i2,0,'L');
	}
	$this->SetFont('gost_a','',12);
	$this->setxy(60+71.5*$p,125);
	$this->Cell(11.5,4.25,'T'.$kn[$p][9],0,2,'L');
	$this->Cell(11.5,4.25,$kn[$p][36],0,2,'L');
	$this->Cell(11.5,4.25,$kn[$p][5],0,2,'L');
	$img=$kn[$p][27];
	if($img!=null) $this->Image($img,5.5+0.25+71.5*$p,137.75+0.25,71,73.5);
}
}
function PrintKN2p($tp, $ds, $pg, $nop, $kn, $countKN){
//_________________________________________________________
//второй лист КН форма 7а ГОСТ 3.1105-84
$this->AddPage('L','A4');
// Рамка B6Ф1 ГОСТ 3.1103-2011 блок вида и назначения документа
$this->rect(5.5,201.5,286,8.5);
$this->rect(5.5,201.5,23.5,8.5);
	//$this->AddFont('gost_a','','GOSTmi.php');
	$this->SetFont('gost_a','',15);	
	$this->SetXY(5.5,201.5);
	$this->Cell(23.5,8.5,'КН',0,0,'C');
	$this->Cell(246.9,8.5,'Карта наладки',0,0,'L');
	$this->Cell(15.6,8.5,$this->PageNo(),0,0,'C');
$this->rect(297-5.5-15.6,201.5,15.6,8.5);
//Данные
$this->SetFont('gost_a','',12);
$this->rect(5.5,44.25,286,157.25);

// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$this->rect(5.5,10.25,75.4,12.75);
$this->line(5.5,14.5,80.9,14.5);
$this->line(5.5,18.75,80.9,18.75);
$this->line(23.7,10.25,23.7,14.5);
$this->line(44.5,10.25,44.5,14.5);
$this->line(65.3,10.25,65.3,14.5);
$this->line(23.7,18.75,23.7,23);
$this->line(44.5,18.75,44.5,23);
$this->line(65.3,18.75,65.3,23);
$this->setxy(5.5,10.25);
$this->SetFont('gost_a','',12);
$this->Cell(18.2,4.25,'Дубл.',1,2,'L');
$this->Cell(18.2,4.25,'Взам.',1,2,'L');
$this->Cell(18.2,4.25,'Подп.',1,2,'L');
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(210.9,6,80.6,17);
$this->line(210.9,10.25,291.5,10.25);
$this->line(210.9,14.5,291.5,14.5);
$this->line(210.9,18.75,291.5,18.75);
$this->line(221.3,6,221.3,23);
$this->line(231.6,6,231.6,23);
$this->line(255.1,6,255.1,23);
$this->line(275.9,6,275.9,23);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(130.3,14.5,80.6,8.5);
$this->line(130.3,18.75,210.9,18.75);
$this->line(140.7,14.5,140.7,23);
$this->line(151.1,14.5,151.1,23);
$this->line(174.5,14.5,174.5,23);
$this->line(195.3,14.5,195.3,23);
// Рамка Б1Ф3а ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$this->rect(171.9,31.5,119.6,12.75);
$this->line(278.5,31.5,278.5,44.25);
$this->line(231.7,31.5,231.7,44.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(91.3,31.5,80.6,12.75);
$this->line(91.3,35.75,171.9,35.75);
$this->line(91.3,40,171.9,40);
$this->line(156.3,31.5,156.3,44.25);
$this->line(135.5,31.5,135.5,44.25);
$this->line(112.1,31.5,112.1,44.25);
$this->line(101.7,31.5,101.7,44.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(10.7,31.5,80.6,12.75);
$this->line(10.7,35.75,91.3,35.75);
$this->line(10.7,40,91.3,40);
$this->line(75.7,31.5,75.7,44.25);
$this->line(54.9,31.5,54.9,44.25);
$this->line(31.5,31.5,31.5,44.25);
$this->line(21.1,31.5,21.1,44.25);
$this->rect(5.5,31.5,5.2,12.75);
// Рамка Б5Ф1а ГОСТ 3.1103-2011 блок вспомогательной информации
$this->rect(5.5,23,286,8.5);
$this->line(275.9,23,275.9,31.5);
$this->line(229.1,23,229.1,31.5);
$this->line(169.3,23,169.3,26);
$this->SetXY(250,2);
$this->Cell(40,4.25,'ГОСТ 3.1105-84 Форма 7а',0,1,'R');
//$this->SetXY(210,4);
//$this->write(0,'ГОСТ 3.1105-84 Форма 7а');
$this->line(148.5,3,148.5,11);
//if (!$imgf=='') $this->Image($imgf,6,53-8.5,285,148);
//
$this->line(5.5,48.5,291.5,48.5);
$this->line(5.5,57,291.5,57);
$this->line(5.5,65.5,291.5,65.5);
$this->line(5.5,74,291.5,74);
$this->line(5.5,82.5,291.5,82.5);
$this->line(5.5,91,291.5,91);
$this->line(5.5,99.5,291.5,99.5);
$this->line(5.5,108,291.5,108);
$this->line(5.5,116.5,291.5,116.5);
$this->line(5.5,125,291.5,125);
$this->line(5.5,129.25,291.5,129.25);
$this->line(5.5,133.5,291.5,133.5);
$this->line(5.5,137.75,291.5,137.75);
$this->line(60,125,60,137.75);
$this->line(131.5,125,131.5,137.75);
$this->line(203,125,203,137.75);
$this->line(274.5,125,274.5,137.75);

$this->line(77,44.25,77,201.5);
$this->line(148.5,44.25,148.5,201.5);
$this->line(220,44.25,220,201.5);

$this->setxy(5.5,125);
$this->Cell(54.5,4.25,'Рабочая позиция',0,2,'L');
$this->Cell(54.5,4.25,'Вылет инструмента (L)',0,2,'L');
$this->Cell(54.5,4.25,'Время работы, мин',0,2,'L');
$this->setxy(77,125);
$this->Cell(54.5,4.25,'Рабочая позиция',0,2,'L');
$this->Cell(54.5,4.25,'Вылет инструмента (L)',0,2,'L');
$this->Cell(54.5,4.25,'Время работы, мин',0,2,'L');
$this->setxy(148.5,125);
$this->Cell(54.5,4.25,'Рабочая позиция',0,2,'L');
$this->Cell(54.5,4.25,'Вылет инструмента (L)',0,2,'L');
$this->Cell(54.5,4.25,'Время работы, мин',0,2,'L');
$this->setxy(220,125);
$this->Cell(54.5,4.25,'Рабочая позиция',0,2,'L');
$this->Cell(54.5,4.25,'Вылет инструмента (L)',0,2,'L');
$this->Cell(54.5,4.25,'Время работы, мин',0,2,'L');
//_________________________________________________________
//вывод текста
$this->SetFont('gost_a','',14);
$this->setxy(184.9-13,31.5);
$this->Cell(59.8,12.75,$ds['designation'],0,0,'C');//Обозначение изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->Cell(46.8,12.75,$tp['doc'],0,0,'C');//обозначение документа по ГОСТ 3.1201
//
$this->Cell(13,12.75,sprintf('%03d',$nop),0,0,'C');//Номер операции
$this->setxy(153.7+15.6,23);
$this->Cell(59.8,8.5,$tp['product'],0,1,'C');//Обозначение изделия или классификационного кода
$this->setxy(275.9,23);
$this->Cell(15.6,8.5,$pg+1,0,1,'C');//Номер листа

for ($p2=0; $p2<4 and ($pg*4+$p2)<$countKN; $p2++){
	$this->setxy(5.5+71.5*$p2,44.25);//№ п/п
	$this->SetFont('gost_a','',12);
	$this->Cell(71.5,4.25,$pg*4+$p2+1,0,2,'C');
	$this->SetFont('gost_a','',10);
	for ($r=1; $r<9; $r++){
		$this->setxy(5.5+71.5*$p2,57+8.5*$r-8.5*2);
		$i2=str_replace(DIAM,'¤',$kn[$pg*4+$p2][27+$r]);
		$this->MultiCell(71.5+30+10,4.25,$i2,0,'L');
	}
	$this->SetFont('gost_a','',12);
	$this->setxy(60+71.5*$p2,125);
	$this->Cell(11.5,4.25,'T'.$kn[$pg*4+$p2][9],0,2,'L');
	$this->Cell(11.5,4.25,$kn[$pg*4+$p2][36],0,2,'L');
	$this->Cell(11.5,4.25,$kn[$pg*4+$p2][5],0,2,'L');
	$img=$kn[$pg*4+$p2][27];
	if($img!=null) $this->Image($img,5.5+0.25+71.5*$p2,137.75+0.25,71,73.5);
}
}
//============================================================================================================
//=== Ведомость оснастки ===
//============================================================================================================
function PrintVO1p($tp, $ds, $pgs){
$today=Date("d.m.y",strtotime($tp['tpdate']));
//ГОСТ 3.1122-86 ВО Форма 3 (Заглавный лист)
//$this->AddFont('gost_a','','GOSTmi.php');
$this->SetFont('gost_a','',12);
$this->SetAutoPageBreak(true,0);
$this->SetMargins(5.5,0,5.5);
$this->SetTextColor( 0, 0, 0);
$this->AddPage('L','A4');
// Рамка B6Ф1 ГОСТ 3.1103-2011 блок вида и назначения документа
$this->rect(5.5,201.5,286,8.5);
$this->rect(5.5,201.5,23.5,8.5);
	$this->SetFont('gost_a','',15);	
	$this->SetXY(5.5,201.5);
	$this->Cell(23.5,8.5,'ВО',0,0,'C');
	$this->Cell(246.9,8.5,'Ведомость оснастки',0,0,'L');
	$this->Cell(15.6,8.5,$this->PageNo(),0,0,'C');
$this->rect(297-5.5-15.6,201.5,15.6,8.5);
// Рамка B3Ф1г ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(5.5,197.25,286,4.25);
$this->line(275.9,197.25,275.9,201.5);
$this->line(255.1,197.25,255.1,201.5);
$this->line(231.7,197.25,231.7,201.5);
$this->line(221.3,197.25,221.3,201.5);
$this->line(210.9,197.25,210.9,201.5);
$this->line(195.3,197.25,195.3,201.5);
$this->line(174.5,197.25,174.5,201.5);
$this->line(151.1,197.25,151.1,201.5);
$this->line(140.7,197.25,140.7,201.5);
$this->line(130.3,197.25,130.3,201.5);
$this->line(114.7,197.25,114.7,201.5);
$this->line(93.9,197.25,93.9,201.5);
$this->line(70.5,197.25,70.5,201.5);
$this->line(60.1,197.25,60.1,201.5);
$this->line(49.7,197.25,49.7,201.5);
//Данные
$this->SetFont('gost_a','',12);
$this->rect(5.5,61.25,286,136);
for ($x=0; $x++<16;){ 
	$this->line(5.5,$x*8.5+61.25,286+5.5,$x*8.5+61.25);
	$this->line(5.5+13,$x*8.5+52.75,5.5+13,61.25+$x*8.5);
	$this->setxy(5.5+5,$x*8.5+52.75);
	$this->cell(13/2,8.5,sprintf('%02d',$x),0,1,'L');
}
//$this->rect(5.5,52.75,286,4.25);
$this->SetFont('gost_a','',12);
$this->setxy(5.5,52.75);
$this->Cell(13,4.25,' С',1,0,'L');
$this->Cell(10.4,4.25,'НПП',1,0,'C');
$this->Cell(59.8,4.25,'Обозначение ДСЕ',1,0,'C');
$this->Cell(187.2,4.25,'Наименование ДСЕ',1,0,'C');
$this->Cell(15.6,4.25,'КП',1,0,'C');
$this->setxy(5.5,57);
$this->Cell(13,4.25,' Т',1,0,'L');
$this->Cell(10.4,4.25,'Опер',1,0,'C');
$this->Cell(59.8,4.25,'Обозначение ТО',1,0,'C');
$this->Cell(15.6,4.25,'Кол.',1,0,'C');
$this->Cell(187.2,4.25,'Наименование ТО',1,0,'C');
$this->SetLineWidth(0.8);
$this->rect(275.9,52.75,15.6,4.25);
$this->line(18.5,57,28.9,57);
$this->line(28.9,57,28.9,52.75);
$this->line(28.9,52.75,88.7,52.75);
$this->line(88.7,52.75,88.7,57);
$this->line(88.7,57,104.3,57);
$this->line(104.3,57,104.3,61.25);
$this->line(104.3,61.25,18.5,61.25);
$this->line(18.5,61.25,18.5,57);
$this->SetLineWidth(0.2);
// Рамка Б5Ф1 ГОСТ 3.1103-2011 блок вспомогательной информации
$this->rect(5.5,23,286,8.5);
$this->line(275.9,23,275.9,31.5);
$this->line(260.3,23,260.3,31.5);
$this->line(213.5,23,213.5,31.5);
$this->line(153.7,23,153.7,26);
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$this->rect(5.5,10.25,75.4,12.75);
$this->line(5.5,14.5,80.9,14.5);
$this->line(5.5,18.75,80.9,18.75);
$this->line(23.7,10.25,23.7,14.5);
$this->line(44.5,10.25,44.5,14.5);
$this->line(65.3,10.25,65.3,14.5);
$this->line(23.7,18.75,23.7,23);
$this->line(44.5,18.75,44.5,23);
$this->line(65.3,18.75,65.3,23);
$this->setxy(5.5,10.25);
$this->SetFont('gost_a','',12);
$this->Cell(18.2,4.25,'Дубл.',1,2,'L');
$this->Cell(18.2,4.25,'Взам.',1,2,'L');
$this->Cell(18.2,4.25,'Подп.',1,2,'L');
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(210.9,6,80.6,17);
$this->line(210.9,10.25,291.5,10.25);
$this->line(210.9,14.5,291.5,14.5);
$this->line(210.9,18.75,291.5,18.75);
$this->line(221.3,6,221.3,23);
$this->line(231.6,6,231.6,23);
$this->line(255.1,6,255.1,23);
$this->line(275.9,6,275.9,23);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(130.3,14.5,80.6,8.5);
$this->line(130.3,18.75,210.9,18.75);
$this->line(140.7,14.5,140.7,23);
$this->line(151.1,14.5,151.1,23);
$this->line(174.5,14.5,174.5,23);
$this->line(195.3,14.5,195.3,23);
// Рамка Б1Ф1 ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$this->rect(101.7,31.5,189.8,21.25);
$this->line(101.7,44.25,291.5,44.25);
$this->line(143.3,31.5,143.3,44.25);
$this->line(203.1,31.5,203.1,44.25);
$this->line(244.7,31.5,244.7,44.25);
$this->line(114.7,44.5,114.7,46.5);
$this->line(281.1,44.25,281.1,52.75);
$this->line(270.7,44.25,270.7,52.75);
$this->line(260.3,44.25,260.3,52.75);
$this->SetLineWidth(0.8);
$this->rect(143.3,31.5,148.2,12.75);
$this->SetLineWidth(0.2);
// Рамка Б2Ф1 ГОСТ 3.1103-2011 Исполнители
$this->rect(5.5,31.5,96.2,21.25);
$this->line(28.9,31.5,28.9,52.75);
$this->line(65.3,31.5,65.3,52.75);
$this->line(86.1,31.5,86.1,52.75);
$this->line(5.5,35.75,101.2,35.75);
$this->line(5.5,40,101.7,40);
$this->line(5.5,44.25,101.7,44.25);
$this->line(5.5,48.5,101.7,48.5);
//Задаем шрифт
//$this->SetFont('arial','',8);
$this->setxy(5.5,31.5);
$this->SetFont('gost_a','',12);
//В ячейке 23.4х4.25 мм с разрывом строк выравнивание текста задаем по левой стороне
$this->Cell(23.4,4.25,'Разраб.',0,2,'L');
$this->Cell(23.4,4.25,'Проверил',0,2,'L');
$this->Cell(23.4,4.25,'Утвердил',0,2,'L');
$this->Cell(23.4,4.25,'',0,2,'L');
//$this->SetXY(5.5,48.5);
$this->Cell(23.4,4.25,'Н.контр.');
$this->SetXY(86.1,31.5);
$this->Cell(15.6,4.25,$today,0,1,'C');
$this->SetXY(250,2);
$this->Cell(40,4.25,'ГОСТ 3.1122-86 Форма 3',0,1,'R');
//$this->SetXY(210,4);
//$this->write(0,'ГОСТ 3.1122-86 Форма 3');
$this->line(148.5,3,148.5,11);
//_________________________________________________________
//вывод текста
$this->SetFont('gost_a','',12);
$this->setxy(28.9,31.5);
$this->Cell(36.4,4.25,$tp['performer'],0,2,'L');//Фамилия исполнителя
$this->Cell(36.4,4.25,$tp['cheсking'],0,2,'L');//Проверил
$this->Cell(36.4,4.25,$tp['approving'],0,2,'L');//Утвердил
$this->Cell(23.4,4.25,'',0,2,'L');
$this->Cell(36.4,4.25,$tp['normcontrol'],0,2,'L');//Н.контроль
$this->SetFont('gost_a','',14);
$this->setxy(244.7,31.5);
$this->Cell(46.8,12.75,$tp['doc'],0,1,'C');//обозначение документа по ГОСТ 3.1201
$this->setxy(101.7,31.5);
if($tp['drawing']!=null){
	$this->Image('./uploads/'.$tp['drawing'],101.7+0.5,31.5+0.5,41.6-1,12.75-1);
}
else{
	$this->Cell(41.6,12.75,$tp['flabel'],0,0,'C');//Краткое наименование или условное обозначение (код) организации (предприятия) - разработчика документа (документов)
}
$this->setxy(143.3,31.5);
$this->Cell(59.8,12.75,$ds['designation'],0,1,'C');//Обозначение изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->setxy(260.3,23);
$this->Cell(15.6,8.5,$pgs,0,0,'C');//Количество листов
//$this->setxy(275.9,23);
$this->Cell(15.6,8.5,'1',0,1,'C');//Номер листа
$this->setxy(153.7,23);
$this->Cell(59.8,8.5,$tp['product'],0,1,'C');//Обозначение изделия или классификационного кода
$this->setxy(114.7,44.25);
$this->Cell(145.6,8.5,$ds['name'],0,0,'C');//Наименование изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->SetFont('gost_a','',12);
$this->Cell(10.4,8.5,$tp['letter1'],0,0,'C');//Стадия проектирования 1
$this->Cell(10.4,8.5,$tp['letter2'],0,0,'C');//Стадия проектирования 2
$this->Cell(10.4,8.5,$tp['letter3'],0,0,'C');//Стадия проектирования 3
//$this->Cell(13,8.5,sprintf('%03d',$op),0,0,'C');//Номер операции
}
function PrintVO2p($tp, $ds, $pg){
//_________________________________________________________
//второй лист ВО форма 3а ГОСТ 3.1122-84
//$this->AddFont('gost_a','','GOSTmi.php');
$this->SetFont('gost_a','',12);
//$this->SetAutoPageBreak(true,0);
//$this->SetMargins(5.5,0,5.5);
//$this->SetTextColor( 0, 0, 0);
$this->AddPage('L','A4');
// Рамка B6Ф1 ГОСТ 3.1103-2011 блок вида и назначения документа
$this->rect(5.5,201.5,286,8.5);
$this->rect(5.5,201.5,23.5,8.5);
	$this->SetFont('gost_a','',15);	
	$this->SetXY(5.5,201.5);
	$this->Cell(23.5,8.5,'ВО',0,0,'C');
	$this->Cell(246.9,8.5,'Ведомость оснастки',0,0,'L');
	$this->Cell(15.6,8.5,$this->PageNo(),0,0,'C');
$this->rect(297-5.5-15.6,201.5,15.6,8.5);
//Данные
$this->SetFont('gost_a','',12);
$this->rect(5.5,52.75,286,144.5);
for ($x=0; $x++<17;){ 
	$this->line(5.5,$x*8.5+52.75,286+5.5,$x*8.5+52.75);
	$this->line(5.5+13,$x*8.5+44.25,5.5+13,52.75+$x*8.5);
	$this->setxy(5.5+5,$x*8.5+44.25);
	$this->cell(13/2,8.5,sprintf('%02d',$x),0,1,'L');
}
$this->SetFont('gost_a','',12);
$this->setxy(5.5,44.25);
$this->Cell(13,4.25,' С',1,0,'L');
$this->Cell(10.4,4.25,'НПП',1,0,'C');
$this->Cell(59.8,4.25,'Обозначение ДСЕ',1,0,'C');
$this->Cell(187.2,4.25,'Наименование ДСЕ',1,0,'C');
$this->Cell(15.6,4.25,'КП',1,0,'C');
$this->setxy(5.5,48.5);
$this->Cell(13,4.25,' Т',1,0,'L');
$this->Cell(10.4,4.25,'Опер',1,0,'C');
$this->Cell(59.8,4.25,'Обозначение ТО',1,0,'C');
$this->Cell(15.6,4.25,'Кол.',1,0,'C');
$this->Cell(187.2,4.25,'Наименование ТО',1,0,'C');
$this->SetLineWidth(0.8);
$this->rect(275.9,44.25,15.6,4.25);
$this->line(18.5,48.5,28.9,48.5);
$this->line(28.9,48.5,28.9,44.25);
$this->line(28.9,44.25,88.7,44.25);
$this->line(88.7,44.25,88.7,48.5);
$this->line(88.7,48.5,104.3,48.5);
$this->line(104.3,48.5,104.3,52.75);
$this->line(104.3,52.75,18.5,52.75);
$this->line(18.5,52.75,18.5,48.5);
$this->SetLineWidth(0.2);
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$this->rect(5.5,10.25,75.4,12.75);
$this->line(5.5,14.5,80.9,14.5);
$this->line(5.5,18.75,80.9,18.75);
$this->line(23.7,10.25,23.7,14.5);
$this->line(44.5,10.25,44.5,14.5);
$this->line(65.3,10.25,65.3,14.5);
$this->line(23.7,18.75,23.7,23);
$this->line(44.5,18.75,44.5,23);
$this->line(65.3,18.75,65.3,23);
$this->setxy(5.5,10.25);
$this->SetFont('gost_a','',12);
$this->Cell(18.2,4.25,'Дубл.',1,2,'L');
$this->Cell(18.2,4.25,'Взам.',1,2,'L');
$this->Cell(18.2,4.25,'Подп.',1,2,'L');
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(210.9,6,80.6,17);
$this->line(210.9,10.25,291.5,10.25);
$this->line(210.9,14.5,291.5,14.5);
$this->line(210.9,18.75,291.5,18.75);
$this->line(221.3,6,221.3,23);
$this->line(231.6,6,231.6,23);
$this->line(255.1,6,255.1,23);
$this->line(275.9,6,275.9,23);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(130.3,14.5,80.6,8.5);
$this->line(130.3,18.75,210.9,18.75);
$this->line(140.7,14.5,140.7,23);
$this->line(151.1,14.5,151.1,23);
$this->line(174.5,14.5,174.5,23);
$this->line(195.3,14.5,195.3,23);
// Рамка Б1Ф1а ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$this->rect(184.9,31.5,106.6,12.75);
$this->line(244.7,31.5,244.7,44.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(104.3,31.5,80.6,12.75);
$this->line(104.3,35.75,184.9,35.75);
$this->line(104.3,40,184.9,40);
$this->line(169.3,31.5,169.3,44.25);
$this->line(148.5,31.5,148.5,44.25);
$this->line(125.1,31.5,125.1,44.25);
$this->line(114.7,31.5,114.7,44.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(23.7,31.5,80.6,12.75);
$this->line(23.7,35.75,104.3,35.75);
$this->line(23.7,40,104.3,40);
$this->line(88.7,31.5,88.7,44.25);
$this->line(67.9,31.5,67.9,44.25);
$this->line(44.5,31.5,44.5,44.25);
$this->line(34.1,31.5,34.1,44.25);
$this->rect(5.5,31.5,18.2,12.75);
// Рамка Б5Ф1а ГОСТ 3.1103-2011 блок вспомогательной информации
$this->rect(5.5,23,286,8.5);
$this->line(275.9,23,275.9,31.5);
$this->line(229.1,23,229.1,31.5);
$this->line(169.3,23,169.3,26);
$this->SetLineWidth(0.2);
$this->SetXY(250,2);
$this->Cell(40,4.25,'ГОСТ 3.1122-84 Форма 3а',0,1,'R');
//$this->SetXY(210,4);
//$this->write(0,'ГОСТ 3.1122-84 Форма 3а');
$this->line(148.5,3,148.5,11);
// Рамка B3Ф1г ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(5.5,197.25,286,4.25);
$this->line(275.9,197.25,275.9,201.5);
$this->line(255.1,197.25,255.1,201.5);
$this->line(231.7,197.25,231.7,201.5);
$this->line(221.3,197.25,221.3,201.5);
$this->line(210.9,197.25,210.9,201.5);
$this->line(195.3,197.25,195.3,201.5);
$this->line(174.5,197.25,174.5,201.5);
$this->line(151.1,197.25,151.1,201.5);
$this->line(140.7,197.25,140.7,201.5);
$this->line(130.3,197.25,130.3,201.5);
$this->line(114.7,197.25,114.7,201.5);
$this->line(93.9,197.25,93.9,201.5);
$this->line(70.5,197.25,70.5,201.5);
$this->line(60.1,197.25,60.1,201.5);
$this->line(49.7,197.25,49.7,201.5);
//_________________________________________________________
//вывод текста
$this->SetFont('gost_a','',14);
$this->setxy(184.9,31.5);
$this->Cell(59.8,12.75,$ds['designation'],0,0,'C');//Обозначение изделия (детали, сборочной единицы) по основному конструкторскому документу
//$this->setxy(244.7,31.5);
$this->Cell(46.8,12.75,$tp['doc'],0,0,'C');//обозначение документа по ГОСТ 3.1201
$this->setxy(153.7+15.6,23);
$this->Cell(59.8,8.5,$tp['product'],0,1,'C');//Обозначение изделия или классификационного кода
$this->setxy(275.9,23);
$this->Cell(15.6,8.5,$pg,0,1,'C');//Номер листа
}
function PrintVOstr($data,$y){
$this->SetFont('gost_a','',12);
$this->setxy(5.5,$y);//Т
$this->cell(13/2,8.5,'Т',0,0,'C');//символ Т
$this->setxy(5.5+13,$y);//Т
$this->cell(10.4,8.5,sprintf('%03d',$data[1]),0,0,'C');//номер операции
$this->cell(59.8,8.5,$data[2],0,0,'L');//обозначение ТО
$this->cell(15.6,8.5,$data[3],0,0,'C');//количество ТО
//$i2=$data[4];
//$i2=str_replace(DIAM,chr(216),$data[4]);
$i2=str_replace(DIAM,'¤',$data[4]);
$this->cell(187.2,8.5,$i2.' '.$data[5],0,0,'L');//наименование ТО
}
//============================================================================================================
//=== Карта контроля ===
//============================================================================================================
function PrintKK1p($tp, $ds, $pgs, $op){
$today=Date("d.m.y",strtotime($tp['tpdate']));
//ГОСТ 3.1505-85 ОК Форма 2 (Заглавный лист)
//$this->AddFont('gost_a','','GOSTmi.php');
$this->SetFont('gost_a','',12);
$this->SetAutoPageBreak(true,0);
$this->SetMargins(5.5,0,5.5);
$this->SetTextColor( 0, 0, 0);
$this->AddPage('L','A4');
// Рамка B6Ф1 ГОСТ 3.1103-2011 блок вида и назначения документа
$this->rect(5.5,201.5,286,8.5);
$this->rect(5.5,201.5,23.5,8.5);
	$this->SetFont('gost_a','',15);	
	$this->SetXY(5.5,201.5);
	$this->Cell(23.5,8.5,'OK',0,0,'C');
	$this->Cell(246.9,8.5,'Технический контроль',0,0,'L');
	$this->Cell(15.6,8.5,$this->PageNo(),0,0,'C');
$this->rect(297-5.5-15.6,201.5,15.6,8.5);
//Данные
$this->SetFont('gost_a','',12);
$this->rect(5.5,86.75+4.25,286,110.5);
for ($x=0; $x++<13;){ 
	$this->line(5.5,$x*8.5+86.75+4.25,286+5.5,$x*8.5+86.75+4.25);
	$this->line(5.5+13,$x*8.5+86.75-8.5+4.25,5.5+13,86.75+$x*8.5+4.25);
	$this->setxy(5.5+5,$x*8.5+86.75-8.5+4.25);
	$this->cell(13/2,8.5,sprintf('%02d',$x),0,1,'L');
}
$this->setxy(5.5,52.75);
$this->SetFont('gost_a','',12);
$this->Cell(143,4.25,'Наименование операции',1,0,'C');
$this->Cell(124.8,4.25,'Наименование, марка материала',1,0,'C');
$this->Cell(18.2,4.25,'МД',1,0,'C');
$this->setxy(5.5,65.5);
$this->Cell(104,4.25,'Наименование оборудования',1,0,'C');
$this->Cell(20.8,4.25,'То',1,0,'C');
$this->Cell(18.2,4.25,'Тв',1,0,'C');
$this->setxy(252.5,65.5);
$this->Cell(39,4.25,'Обозначение ИОТ',1,0,'C');
$this->rect(5.5,57,143,8.5);
$this->rect(148.5,57,124.8,8.5);
$this->rect(273.3,57,18.2,8.5);
$this->rect(148.5,65.5,104,4.25);
$this->rect(5.5,69.75,104,12.75);
$this->SetLineWidth(0.8);
$this->rect(109.5,69.75,20.8,12.75);
$this->rect(130.3,69.75,18.2,12.75);
$this->SetLineWidth(0.2);
$this->rect(252.5,69.75,39,12.75);
$this->setXY(5.5,82.5);
$this->cell(13,8.5,'Р',1,0,'C');
$this->cell(65,8.5,'Контролируемые параметры',1,0,'C');
$this->cell(65,8.5,'Код средств измерений',1,0,'C');
$this->cell(104,8.5,'Наименование средств измерений',1,0,'C');
$this->cell(20.8,8.5,'Объём и ПК',1,0,'C');
$this->cell(18.2,8.5,'То/Тв',1,0,'C');
// Рамка Б5Ф1 ГОСТ 3.1103-2011 блок вспомогательной информации
$this->rect(5.5,23,286,8.5);
$this->line(275.9,23,275.9,31.5);
$this->line(260.3,23,260.3,31.5);
$this->line(213.5,23,213.5,31.5);
$this->line(153.7,23,153.7,26);
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$this->rect(5.5,10.25,75.4,12.75);
$this->line(5.5,14.5,80.9,14.5);
$this->line(5.5,18.75,80.9,18.75);
$this->line(23.7,10.25,23.7,14.5);
$this->line(44.5,10.25,44.5,14.5);
$this->line(65.3,10.25,65.3,14.5);
$this->line(23.7,18.75,23.7,23);
$this->line(44.5,18.75,44.5,23);
$this->line(65.3,18.75,65.3,23);
$this->setxy(5.5,10.25);
$this->SetFont('gost_a','',12);
$this->Cell(18.2,4.25,'Дубл.',1,2,'L');
$this->Cell(18.2,4.25,'Взам.',1,2,'L');
$this->Cell(18.2,4.25,'Подп.',1,2,'L');
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(210.9,6,80.6,17);
$this->line(210.9,10.25,291.5,10.25);
$this->line(210.9,14.5,291.5,14.5);
$this->line(210.9,18.75,291.5,18.75);
$this->line(221.3,6,221.3,23);
$this->line(231.6,6,231.6,23);
$this->line(255.1,6,255.1,23);
$this->line(275.9,6,275.9,23);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(130.3,14.5,80.6,8.5);
$this->line(130.3,18.75,210.9,18.75);
$this->line(140.7,14.5,140.7,23);
$this->line(151.1,14.5,151.1,23);
$this->line(174.5,14.5,174.5,23);
$this->line(195.3,14.5,195.3,23);
// Рамка Б1Ф3 ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$this->rect(101.7,31.5,189.8,21.25);
$this->line(101.7,44.25,291.5,44.25);
$this->line(143.3,31.5,143.3,44.25);
$this->line(203.1,31.5,203.1,44.25);
$this->line(244.7,31.5,244.7,44.25);
$this->line(114.7,44.5,114.7,46.5);
$this->line(278.5,44.25,278.5,52.75);
$this->line(268.1,44.25,268.1,52.75);
$this->line(257.7,44.25,257.7,52.75);
$this->line(247.3,44.25,247.3,52.75);
$this->SetLineWidth(0.8);
$this->rect(143.3,31.5,148.2,12.75);
$this->SetLineWidth(0.2);
// Рамка Б2Ф1 ГОСТ 3.1103-2011 Исполнители
$this->rect(5.5,31.5,96.2,21.25);
$this->line(28.9,31.5,28.9,52.75);
$this->line(65.3,31.5,65.3,52.75);
$this->line(86.1,31.5,86.1,52.75);
$this->line(5.5,35.75,101.2,35.75);
$this->line(5.5,40,101.7,40);
$this->line(5.5,44.25,101.7,44.25);
$this->line(5.5,48.5,101.7,48.5);
//Задаем шрифт
//$this->SetFont('arial','',8);
$this->setxy(5.5,31.5);
$this->SetFont('gost_a','',12);
//В ячейке 23.4х4.25 мм с разрывом строк выравнивание текста задаем по левой стороне
$this->Cell(23.4,4.25,'Разраб.',0,2,'L');
$this->Cell(23.4,4.25,'Проверил',0,2,'L');
$this->Cell(23.4,4.25,'Утвердил',0,2,'L');
$this->Cell(23.4,4.25,'',0,2,'L');
//$this->SetXY(5.5,48.5);
$this->Cell(23.4,4.25,'Н.контр.');
$this->SetXY(86.1,31.5);
$this->Cell(15.6,4.25,$today,0,1,'C');
$this->SetXY(250,2);
$this->Cell(40,4.25,'ГОСТ 3.1505-85 Форма 2',0,1,'R');
//$this->SetXY(210,4);
//$this->write(0,'ГОСТ 3.1505-85 Форма 2');
$this->line(148.5,3,148.5,11);
//_________________________________________________________
//вывод текста
$this->SetFont('gost_a','',12);
$this->setxy(28.9,31.5);
$this->Cell(36.4,4.25,$tp['performer'],0,2,'L');//Фамилия исполнителя
$this->Cell(36.4,4.25,$tp['cheсking'],0,2,'L');//Проверил
$this->Cell(36.4,4.25,$tp['approving'],0,2,'L');//Утвердил
$this->Cell(23.4,4.25,'',0,2,'L');
$this->Cell(36.4,4.25,$tp['normcontrol'],0,2,'L');//Н.контроль
$this->SetFont('gost_a','',14);
$this->setxy(244.7,31.5);
$this->Cell(46.8,12.75,$tp['doc'],0,1,'C');//обозначение документа по ГОСТ 3.1201
$this->setxy(101.7,31.5);
if($tp['drawing']!=null){
	$this->Image('./uploads/'.$tp['drawing'],101.7+0.5,31.5+0.5,41.6-1,12.75-1);
}
else{
	$this->Cell(41.6,12.75,$tp['flabel'],0,0,'C');//Краткое наименование или условное обозначение (код) организации (предприятия) - разработчика документа (документов)
}
$this->setxy(143.3,31.5);
$this->Cell(59.8,12.75,$ds['designation'],0,1,'C');//Обозначение изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->setxy(260.3,23);
$this->Cell(15.6,8.5,$pgs,0,0,'C');//Количество листов
//$this->setxy(275.9,23);
$this->Cell(15.6,8.5,'1',0,1,'C');//Номер листа
$this->setxy(153.7,23);
$this->Cell(59.8,8.5,$tp['product'],0,1,'C');//Обозначение изделия или классификационного кода
$this->setxy(114.7,44.25);
$this->Cell(132.6,8.5,$ds['name'],0,0,'C');//Наименование изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->SetFont('gost_a','',12);
$this->Cell(10.4,8.5,$tp['letter1'],0,0,'C');//Стадия проектирования 1
$this->Cell(10.4,8.5,$tp['letter2'],0,0,'C');//Стадия проектирования 2
$this->Cell(10.4,8.5,$tp['letter3'],0,0,'C');//Стадия проектирования 3
$this->Cell(13,8.5,sprintf('%03d',$op[0][5]),0,0,'C');//Номер операции
$this->SetFont('gost_a','',12);
$this->setxy(5.5,57);
$this->Cell(143,8.5,$op[0][6],0,0,'C');//Наименование операции
$this->Cell(124.8,8.5,$ds['material'],0,0,'C');//Материал

if ($tp['mass']>0){
$this->Cell(18.2,8.5,number_format($tp['mass'],2,',',''),0,0,'C');//Масса детали
}
else{$this->Cell(18.2,8.5,NULL,0,0,'C');};

//$this->Cell(18.2,8.5,number_format($tp['mass'],2,',',''),0,0,'C');//Масса детали
$this->setxy(5.5,69.75);
$this->Cell(104,12.75,$op[0][15]." ".$op[0][12],0,0,'C');//Оборудование
if ($op[0][29]==0) $To=null; else $To=number_format($op[0][30],2,',','');
$this->Cell(18.2,12.75,$To,0,0,'C');//То
if ($op[0][30]==0) $Tv=null; else $Tv=number_format($op[0][31],2,',','');
$this->Cell(20.8,12.75,$Tv,0,0,'C');//Тв
$this->Cell(104,12.75,$op[0][8],0,0,'C');//Документ
$this->setxy(252.5,65.5+4.25);
$this->Cell(39,12.75,$op[0][9],0,0,'C');//ИОТ
}
function PrintKK2p($tp, $ds, $pg, $nop){
//_________________________________________________________
//второй лист КК форма 2а ГОСТ 3.1502-85
$this->AddPage('L','A4');
// Рамка B6Ф1 ГОСТ 3.1103-2011 блок вида и назначения документа
$this->rect(5.5,201.5,286,8.5);
$this->rect(5.5,201.5,23.5,8.5);
	$this->SetFont('gost_a','',15);	
	$this->SetXY(5.5,201.5);
	$this->Cell(23.5,8.5,'OK',0,0,'C');
	$this->Cell(246.9,8.5,'Технический контроль',0,0,'L');
	$this->Cell(15.6,8.5,$this->PageNo(),0,0,'C');
$this->rect(297-5.5-15.6,201.5,15.6,8.5);
//Данные
$this->SetFont('gost_a','',12);
$this->rect(5.5,52.75,286,144.5);
for ($x=0; $x++<17;){ 
	$this->line(5.5,$x*8.5+52.75,286+5.5,$x*8.5+52.75);
	$this->line(5.5+13,$x*8.5+44.25,5.5+13,52.75+$x*8.5);
	$this->setxy(5.5+5,$x*8.5+44.25);
	$this->cell(13/2,8.5,sprintf('%02d',$x),0,1,'L');
}
$this->setXY(5.5,44.25);
$this->cell(13,8.5,'Р',1,0,'C');
$this->cell(65,8.5,'Контролируемые параметры',1,0,'C');
$this->cell(65,8.5,'Код средств измерений',1,0,'C');
$this->cell(104,8.5,'Наименование средств измерений',1,0,'C');
$this->cell(20.8,8.5,'Объём и ПК',1,0,'C');
$this->cell(18.2,8.5,'То/Тв',1,0,'C');
// Рамка Б4Ф1 ГОСТ 3.1103-2011 блок дополнительной информации
$this->rect(5.5,10.25,75.4,12.75);
$this->line(5.5,14.5,80.9,14.5);
$this->line(5.5,18.75,80.9,18.75);
$this->line(23.7,10.25,23.7,14.5);
$this->line(44.5,10.25,44.5,14.5);
$this->line(65.3,10.25,65.3,14.5);
$this->line(23.7,18.75,23.7,23);
$this->line(44.5,18.75,44.5,23);
$this->line(65.3,18.75,65.3,23);
$this->setxy(5.5,10.25);
$this->SetFont('gost_a','',12);
$this->Cell(18.2,4.25,'Дубл.',1,2,'L');
$this->Cell(18.2,4.25,'Взам.',1,2,'L');
$this->Cell(18.2,4.25,'Подп.',1,2,'L');
// Рамка Б3Ф1а ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(210.9,6,80.6,17);
$this->line(210.9,10.25,291.5,10.25);
$this->line(210.9,14.5,291.5,14.5);
$this->line(210.9,18.75,291.5,18.75);
$this->line(221.3,6,221.3,23);
$this->line(231.6,6,231.6,23);
$this->line(255.1,6,255.1,23);
$this->line(275.9,6,275.9,23);
// Рамка Б3Ф1в ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(130.3,14.5,80.6,8.5);
$this->line(130.3,18.75,210.9,18.75);
$this->line(140.7,14.5,140.7,23);
$this->line(151.1,14.5,151.1,23);
$this->line(174.5,14.5,174.5,23);
$this->line(195.3,14.5,195.3,23);
// Рамка Б1Ф3а ГОСТ 3.1103-2011 блок адресной (поисковой) информации
$this->rect(171.9,31.5,119.6,12.75);
$this->line(278.5,31.5,278.5,44.25);
$this->line(231.7,31.5,231.7,44.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(91.3,31.5,80.6,12.75);
$this->line(91.3,35.75,171.9,35.75);
$this->line(91.3,40,171.9,40);
$this->line(156.3,31.5,156.3,44.25);
$this->line(135.5,31.5,135.5,44.25);
$this->line(112.1,31.5,112.1,44.25);
$this->line(101.7,31.5,101.7,44.25);
// Рамка Б3Ф1б ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(10.7,31.5,80.6,12.75);
$this->line(10.7,35.75,91.3,35.75);
$this->line(10.7,40,91.3,40);
$this->line(75.7,31.5,75.7,44.25);
$this->line(54.9,31.5,54.9,44.25);
$this->line(31.5,31.5,31.5,44.25);
$this->line(21.1,31.5,21.1,44.25);
$this->rect(5.5,31.5,5.2,12.75);
// Рамка Б5Ф1а ГОСТ 3.1103-2011 блок вспомогательной информации
$this->rect(5.5,23,286,8.5);
$this->line(275.9,23,275.9,31.5);
$this->line(229.1,23,229.1,31.5);
$this->line(169.3,23,169.3,26);
$this->SetXY(250,2);
$this->Cell(40,4.25,'ГОСТ 3.1502-85 Форма 2а',0,1,'R');
//$this->SetXY(210,4);
//$this->write(0,'ГОСТ 3.1502-85 Форма 2а');
$this->line(148.5,3,148.5,11);
// Рамка B3Ф1г ГОСТ 3.1103-2011 блок внесения изменений
$this->rect(5.5,197.25,286,4.25);
$this->line(275.9,197.25,275.9,201.5);
$this->line(255.1,197.25,255.1,201.5);
$this->line(231.7,197.25,231.7,201.5);
$this->line(221.3,197.25,221.3,201.5);
$this->line(210.9,197.25,210.9,201.5);
$this->line(195.3,197.25,195.3,201.5);
$this->line(174.5,197.25,174.5,201.5);
$this->line(151.1,197.25,151.1,201.5);
$this->line(140.7,197.25,140.7,201.5);
$this->line(130.3,197.25,130.3,201.5);
$this->line(114.7,197.25,114.7,201.5);
$this->line(93.9,197.25,93.9,201.5);
$this->line(70.5,197.25,70.5,201.5);
$this->line(60.1,197.25,60.1,201.5);
$this->line(49.7,197.25,49.7,201.5);
//_________________________________________________________
//вывод текста
$this->SetFont('gost_a','',14);
$this->setxy(184.9-13,31.5);
$this->Cell(59.8,12.75,$ds['designation'],0,0,'C');//Обозначение изделия (детали, сборочной единицы) по основному конструкторскому документу
$this->Cell(46.8,12.75,$tp['doc'],0,0,'C');//обозначение документа по ГОСТ 3.1201

$this->Cell(13,12.75,sprintf('%03d',$nop),0,0,'C');//Номер операции
$this->setxy(153.7+15.6,23);
$this->Cell(59.8,8.5,$tp['product'],0,1,'C');//Обозначение изделия или классификационного кода
$this->setxy(275.9,23);
$this->Cell(15.6,8.5,$pg,0,1,'C');//Номер листа
}
function PrintKKstr($data,$y){
$this->SetFont('gost_a','',12);
$this->setxy(5.5,$y);//Р
$this->cell(13/2,8.5,'Р',0,0,'C');//символ Р
$perehod=str_replace(DIAM,'¤',$data[2]);
$perehod=$this->Special($perehod,$y);
$this->setxy(5.5+13,$y);//
$this->cell(65,8.5,$perehod,0,0,'L');//Контролируемые параметры
$this->cell(65,8.5,$data[3],0,0,'L');//Код средств измерений
$instr=str_replace(DIAM,'¤',$data[4]);
$this->cell(104,8.5,$instr,0,0,'L');//Наименование средств измерений
if ($data[5]==0) $PK=null; else $PK=$data[5];
$this->cell(20.8,8.5,$PK,0,0,'C');//Объём и ПК
if (($data[6]==0)&&($data[7]==0)) $Tov=null; else $Tov=$data[6]+$data[7];
$this->cell(18.2,8.5,$Tov,0,0,'C');//То/Тв
}
}
?>